H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// BibleInterface.cpp
// Marauder Bible Firmware — Bible reader implementation
//
// Streaming OSIS XML parser reads verses directly from the SD card.
// No Python pre-processing step required.

#include "BibleInterface.h"
#include "BibleKeyboard.h"
#include "VerseBroadcast.h"
#include "fonts_vlw.h"          // flash-resident smooth (VLW) fonts (reader + whole UI)
#include "fonts_vlw_fraktur.h"        // Fraktur body set (song text, flagged songbooks)
#include "fonts_vlw_fraktur_title.h"  // Fraktur title set (song/category/book titles)

#ifdef HAS_SCREEN

#include <math.h>
#include "esp_ota_ops.h"
#include "esp_partition.h"

#ifdef HAS_CAP_TOUCH
  #include "ft6336.h"
#endif

// ─────────────────────────────────────────────────────────────────────────────
// Static brightness levels (PWM duty, 8-bit, 0-255)
// ─────────────────────────────────────────────────────────────────────────────
const uint8_t BibleInterface::BL_LEVELS[20] = {
      3,  16,  30,  44,  57,  71,  84,  98,
    111, 125, 138, 152, 165, 179, 192, 206,
    219, 233, 246, 255
};

// ─────────────────────────────────────────────────────────────────────────────
// Accent / highlight colour palette (20 options, ordered by hue, cycled from Settings)
// ─────────────────────────────────────────────────────────────────────────────
// 24 jewel-tone darks (contrast with dim_fg ~medium-gray on dark bg)
// Ordered by hue: greens → cyans → blues → purples → pinks → reds → oranges → yellows
static const uint16_t ACCENT_DARK[] = {
    0x0460,  // Green    RGB(  0,140,  0)
    0x0282,  // Forest   RGB(  0, 80, 16)
    0x03CA,  // Mint     RGB(  0,120, 80)
    0x0350,  // Teal     RGB(  0,106,128)
    0x03D9,  // Cyan     RGB(  0,121,200)
    0x047B,  // Sky      RGB(  0,140,216)
    0x0291,  // Steel    RGB(  0, 80,136)
    0x0339,  // Blue     RGB(  0,100,200)
    0x0213,  // Navy     RGB(  0, 64,152)
    0x2813,  // Indigo   RGB( 40,  0,152)
    0x5016,  // Violet   RGB( 80,  0,176)
    0x500F,  // Purple   RGB( 80,  0,120)
    0x6009,  // Magenta  RGB( 96,  0, 72)
    0xA00C,  // Pink     RGB(160,  0, 96)
    0x8803,  // Crimson  RGB(136,  0, 24)
    0x5800,  // Red      RGB( 88,  0,  0)
    0xB1E3,  // Coral    RGB(176, 56, 24)
    0x6181,  // Brown    RGB( 96, 48,  8)
    0x7280,  // Orange   RGB(112, 80,  0)
    0x8240,  // Amber    RGB(128, 72,  0)
    0xA360,  // Gold     RGB(160,108,  0)
    0xA460,  // Yellow   RGB(160,136,  0)
    0x52E0,  // Olive    RGB( 80, 92,  0)
    0x3504,  // Lime     RGB( 48,160, 32)
};
// 24 pastel lights (contrast with dim_fg ~medium-dark-gray on light bg)
static const uint16_t ACCENT_LIGHT[] = {
    0xB696,  // Green    RGB(180,212,176) sage
    0xB737,  // Forest   RGB(176,228,184)
    0xB79A,  // Mint     RGB(176,240,208)
    0xAF3C,  // Teal     RGB(168,232,224)
    0xBF7D,  // Cyan     RGB(188,240,232)
    0xBEFF,  // Sky      RGB(184,220,248)
    0xB69E,  // Steel    RGB(176,212,240)
    0xBEDF,  // Blue     RGB(188,216,248)
    0xC69F,  // Navy     RGB(192,208,248) periwinkle
    0xCDBF,  // Indigo   RGB(204,180,248) lavender
    0xD5DF,  // Violet   RGB(208,184,248)
    0xE61F,  // Purple   RGB(228,192,248)
    0xFDBB,  // Magenta  RGB(248,180,216)
    0xFDDB,  // Pink     RGB(248,184,216)
    0xFE5A,  // Crimson  RGB(248,200,208) light rose
    0xFDB7,  // Red      RGB(248,180,184) rose
    0xFE15,  // Coral    RGB(248,192,168)
    0xDDF4,  // Brown    RGB(216,188,160)
    0xFD40,  // Orange   RGB(248,168,  0)
    0xFEAD,  // Amber    RGB(248,212,104)
    0xFF12,  // Gold     RGB(248,224,144)
    0xFFD5,  // Yellow   RGB(248,248,168)
    0xCEF3,  // Olive    RGB(200,220,152)
    0xCFF3,  // Lime     RGB(200,252,152)
};
static const char* const ACCENT_NAMES[] = {
    "Green","Forest","Mint","Teal","Cyan","Sky",
    "Steel","Blue","Navy","Indigo","Violet","Purple",
    "Magenta","Pink","Crimson","Red","Coral","Brown",
    "Orange","Amber","Gold","Yellow","Olive","Lime"
};
static const uint8_t ACCENT_COUNT = 24;

// ─────────────────────────────────────────────────────────────────────────────
// Reading-text colour palette (Font Color setting). Index 0 = "Default" (follows
// the theme). The rest are white + shades of gray + black (RGB565).
// ─────────────────────────────────────────────────────────────────────────────
// Index 0 = "Default" (each user — font_fg / verse_num_fg — supplies its own
// default for index 0). Indices 1+ are explicit colours shared by both settings.
static const char* const FONT_COLOR_NAMES[] = {
    "Default", "White", "Silver", "Light Gray", "Gray", "Dim Gray",
    "Dark Gray", "Charcoal", "Black",
    "Red", "Orange", "Amber", "Yellow", "Lime", "Green", "Teal",
    "Cyan", "Sky", "Blue", "Indigo", "Purple", "Magenta", "Pink", "Brown"
};
static const uint16_t FONT_COLOR_VAL[] = {
    0x0000,   // [0] Default — unused (caller returns its own default)
    0xFFFF,   // White
    0xC618,   // Silver
    0xAD55,   // Light Gray
    0x8410,   // Gray
    0x6B4D,   // Dim Gray
    0x4208,   // Dark Gray
    0x2104,   // Charcoal
    0x0000,   // Black
    0xF800,   // Red
    0xFC60,   // Orange
    0xFD20,   // Amber
    0xFFE0,   // Yellow
    0xAFE5,   // Lime
    0x07E0,   // Green
    0x0594,   // Teal
    0x07FF,   // Cyan
    0x5D1F,   // Sky
    0x001F,   // Blue
    0x4019,   // Indigo
    0x801F,   // Purple
    0xF81F,   // Magenta
    0xFD9F,   // Pink
    0xA145,   // Brown
};
static const uint8_t FONT_COLOR_COUNT = 24;

// Screen orientation options (global). 0/2 portrait, 1/3 landscape.
static const char* const ORIENT_NAMES[4] = { "Normal", "Landscape", "Flip 180", "Land. Flip" };
static const uint8_t ORIENT_COUNT = 4;

// ─────────────────────────────────────────────────────────────────────────────
// Colour themes (RGB565). `dark` selects the accent (DARK vs LIGHT) palette and
// divider/scrollbar shades. The first two match the original Dark/Light look.
// ─────────────────────────────────────────────────────────────────────────────
struct ThemeDef { uint16_t bg, fg, hdr, dim; bool dark; const char* name; };
static const ThemeDef THEMES[] = {
    { 0x0000, 0xFFFF, 0x1082, 0x7BEF, true,  "Dark"   },  // black / white
    { 0xFFFF, 0x0000, 0x4A69, 0x632C, false, "Light"  },  // white / black
    { 0xF717, 0x51E3, 0x8B26, 0xB4AD, false, "Sepia"  },  // cream / brown
    { 0x0000, 0xAD55, 0x0841, 0x4208, true,  "Night"  },  // black / soft gray
    { 0x2104, 0xE73C, 0x4209, 0x8410, true,  "Gray"   },  // dark gray / near-white
    { 0x0866, 0xFFFF, 0x190C, 0x73D4, true,  "Navy"   },  // deep blue / white
    { 0x0141, 0xCF99, 0x0242, 0x646C, true,  "Forest" },  // dark green / pale green
    { 0x28E2, 0xE6B6, 0x51C5, 0x93CB, true,  "Mocha"  },  // dark brown / cream
    { 0x0105, 0xBF5E, 0x020A, 0x5CB4, true,  "Ocean"  },  // deep teal / pale cyan
    { 0x2085, 0xE65D, 0x420A, 0x9B74, true,  "Plum"   },  // dark purple / lilac
    { 0x0000, 0xFD80, 0x28E0, 0x82C0, true,  "Amber"  },  // black / amber
    { 0x2883, 0xF6BA, 0x5905, 0xAB6F, true,  "Rose"   },  // dark maroon / pink
    { 0xE7BD, 0x21C5, 0x650F, 0x7D51, false, "Mint"   },  // pale mint / dark green
    { 0x30C8, 0xFD4B, 0x718A, 0xD3CC, true,  "Sunset"  }, // dusk purple / warm orange
    { 0x0842, 0x07F9, 0x0249, 0x04B1, true,  "Cyber"   }, // near-black / neon cyan
    { 0x20C2, 0xD5D1, 0x51C4, 0x93CB, true,  "Coffee"  }, // dark brown / tan
    { 0xE79F, 0x1989, 0x6497, 0x8516, false, "Arctic"  }, // icy light / deep blue
    { 0x1801, 0xFE59, 0x6802, 0xBB0D, true,  "Crimson" }, // dark red / pink
    { 0xEF5F, 0x394A, 0x8BD7, 0x9476, false, "Lavender"}, // pale violet / plum
    { 0x0000, 0xFFFF, 0x0841, 0x4208, true,  "Neon"   },  // black / white + rainbow outlines
};
static const uint8_t THEME_COUNT = 20;
static const uint8_t THEME_NEON  = 19;   // index of the Neon theme (last entry)

