H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// Forward declarations for the VLW helpers used below (defined after drawListRow).
static inline uint16_t vlwPrivToUnicode(uint8_t c);
static int16_t vlwAdvance(const uint8_t* font, uint16_t uni);
static int16_t vlwSpaceWidth(const uint8_t* font);
static void    vlwPrivToUtf8(const char* in, char* out, size_t n);
// The UI (menus / headers / nav / keyboard) smooth font, kept loaded on tft. All
// TFT_eSPI text calls auto-route to it while it is loaded, so the whole UI renders
// with the anti-aliased VLW font — and the umlaut glyphs come from the font itself.
static const uint8_t* g_ui_vlw = VLW_FONTS[2].data;
// Exposed to BibleKeyboard.cpp (external linkage) so it can render its options strip
// X-Small without duplicating the font arrays in its translation unit.
const uint8_t* g_kb_font_small = VLW_FONTS[1].data;
const uint8_t* g_kb_font_main  = VLW_FONTS[2].data;

// Draw one private-code character on tft at (x, y) using the loaded UI VLW font.
// The bitmap `font`/`color` args are ignored (color comes from setTextColor).
// Returns the advance width.
static int16_t tftCharUTF8(TFT_eSPI& tft, uint8_t c, int16_t x, int16_t y,
                             uint8_t /*font*/, uint16_t /*color*/) {
    uint16_t uni = vlwPrivToUnicode(c);
    tft.setCursor(x, y);
    tft.drawGlyph(uni);                       // uses tft's loaded smooth font
    if (c == ' ') return vlwSpaceWidth(g_ui_vlw);
    int16_t a = vlwAdvance(g_ui_vlw, uni);
    return (a < 0) ? (int16_t)(vlwSpaceWidth(g_ui_vlw) + 1) : a;
}

void BibleInterface::drawListRow(int16_t y_px, const char* text, bool selected, bool has_arrow) {
    uint16_t bg_c  = selected ? sel_bg() : bg();
    uint16_t fg_c  = font_fg();   // list item text follows the Font Color setting
    // Right edge: leave room for scrollbar (6px) + arrow (14px) + small gap
    int16_t  max_x = (int16_t)scrW() - (has_arrow ? 28 : 8);
    int16_t  ty    = y_px + (itemH() - 16) / 2;
    tft.fillRect(0, y_px, scrW(), itemH(), bg_c);
    tft.setTextColor(fg_c, bg_c);
    // Draw text char-by-char with private-code umlaut/ß support
    int16_t tx = 10;
    for (const char* p = text; *p && tx < max_x; p++)
        tx += tftCharUTF8(tft, (uint8_t)*p, tx, ty, 2, fg_c);
    if (has_arrow)
        drawChevron(scrW() - 22, y_px, 16, itemH(), true, font_fg());  // follows Font Color
    // divider
    tft.drawFastHLine(0, y_px + itemH() - 1, scrW(),
                      edgeColor(y_px / (int16_t)itemH(), dark_mode ? 0x2104 : 0xC618));
}

// Sprite version of drawListRow, drawing into `spr` at sprite-local coordinates
// (mirrors drawListRow but uses printToSprite, for flicker-free momentum scrolling
// like the reading/search views). The caller loads the row font into `spr`, pushes
// the sprite, and draws the chevron on the TFT afterwards. `y_px` (screen Y) is used
// only for the alternating divider colour.
void BibleInterface::drawListRowSprite(TFT_eSprite& spr, int16_t y_px,
                                       const char* text, bool selected, bool has_arrow) {
    uint16_t bg_c  = selected ? sel_bg() : bg();
    uint16_t fg_c  = font_fg();
    int16_t  max_x = (int16_t)scrW() - (has_arrow ? 28 : 8);
    int16_t  ty    = (int16_t)((itemH() - 16) / 2);
    spr.fillSprite(bg_c);
    spr.setTextColor(fg_c, bg_c);
    int16_t tx = 10;
    for (const char* p = text; *p && tx < max_x; p++) {
        uint8_t c = (uint8_t)*p;
        spr.setCursor(tx, ty);
        char one[2] = { *p, 0 }, u8[8];
        vlwPrivToUtf8(one, u8, sizeof(u8));
        spr.printToSprite(u8, strlen(u8));
        int16_t a = (c == ' ') ? vlwSpaceWidth(g_ui_vlw)
                               : vlwAdvance(g_ui_vlw, vlwPrivToUnicode(c));
        tx += (a < 0) ? (int16_t)(vlwSpaceWidth(g_ui_vlw) + 1) : a;
    }
    spr.drawFastHLine(0, (int16_t)itemH() - 1, scrW(),
                      edgeColor(y_px / (int16_t)itemH(), dark_mode ? 0x2104 : 0xC618));
}

void BibleInterface::drawScrollBar(int16_t total, int16_t vis, int16_t top) {
    if (total <= vis) return;
    uint16_t barX = scrW() - 6;
    uint16_t barY = contentY();
    uint16_t barH = contentH();
    tft.fillRect(barX, barY, 6, barH, dark_mode ? 0x2104 : 0xC618);
    int16_t thumbH = max((int16_t)10, (int16_t)(barH * vis / total));
    int16_t thumbY = barY + (int16_t)((int32_t)top * (barH - thumbH) / max(1, total - vis));
    tft.fillRect(barX, thumbY, 6, thumbH, edgeColor(top, dim_fg()));
}

// Crisp centered "<"/">" selector arrow (solid triangle) — vector, so no font
// reload; safe to call every frame in the settings scroll path.
void BibleInterface::drawChevron(int16_t bx, int16_t by, int16_t bw, int16_t bh, bool right, uint16_t col) {
    int16_t cx = bx + bw / 2, cy = by + bh / 2;
    if (right) tft.fillTriangle(cx - 2, cy - 4, cx - 2, cy + 4, cx + 3, cy, col);
    else       tft.fillTriangle(cx + 2, cy - 4, cx + 2, cy + 4, cx - 3, cy, col);
}
// Centered "+"/"-" for the brightness selector (2px strokes). The +'s right and
// bottom arms are 1px shorter so the cross looks evenly proportioned.
void BibleInterface::drawPlusMinus(int16_t bx, int16_t by, int16_t bw, int16_t bh, bool plus, uint16_t col) {
    int16_t cx = bx + bw / 2, cy = by + bh / 2;
    tft.fillRect(cx - 5, cy - 1, 10, 2, col);              // horizontal bar (right −1px)
    if (plus) tft.fillRect(cx - 1, cy - 5, 2, 10, col);    // vertical bar (bottom −1px)
}
// Draw centered text at the X-Small size, vertically centered in [boxY, boxY+boxH).
// Toggles the loaded UI font; use only off the per-frame scroll path.
void BibleInterface::drawSmallCentered(const char* s, int16_t cx, int16_t boxY, int16_t boxH,
                                       uint16_t fg, uint16_t bg) {
    setUiFont(1);   // X-Small
    int16_t y = boxY + (boxH - (int16_t)VLW_FONTS[1].lineH) / 2;
    tft.setTextColor(fg, bg);
    tft.drawCentreString(s, cx, y, 1);
    setUiFont(2);   // restore normal UI size
}

// ─────────────────────────────────────────────────────────────────────────────
// Smooth (VLW) font helpers for the reading view.
// The reader renders with an anti-aliased VLW font (fonts_vlw.h) instead of the
// TFT_eSPI bitmap fonts. Umlauts are stored as private codes (0x80..0x86); the
// VLW contains the real glyphs, so we map private → UTF-8 for drawString and read
// glyph advances straight from the flash array for text wrapping.
// ─────────────────────────────────────────────────────────────────────────────
static inline uint32_t vlwBE32(const uint8_t* p) {
    return ((uint32_t)p[0] << 24) | ((uint32_t)p[1] << 16) |
           ((uint32_t)p[2] << 8)  |  (uint32_t)p[3];
}
// Map a private code (umlauts 0x80-0x86, typographic marks 0x87-0x8E) to its
// Unicode code point; plain ASCII passes through.
static inline uint16_t vlwPrivToUnicode(uint8_t c) {
    switch (c) {
        case 0x80: return 0xC4; case 0x81: return 0xE4;   // Ä ä
        case 0x82: return 0xD6; case 0x83: return 0xF6;   // Ö ö
        case 0x84: return 0xDC; case 0x85: return 0xFC;   // Ü ü
        case 0x86: return 0xDF;                            // ß
        case 0x87: return 0x201E;                          // „  low double quote
        case 0x88: return 0x201C;                          // "  high double quote
        case 0x89: return 0x201A;                          // ‚  low single quote
        case 0x8A: return 0x2018;                          // '  left single quote
        case 0x8B: return 0x2019;                          // '  right single quote
        case 0x8C: return 0x2013;                          // –  en dash
        case 0x8D: return 0x2014;                          // —  em dash
        case 0x8E: return 0x2026;                          // …  ellipsis
        case 0x8F: return 0x2030;                          // ‰  per mille
        default:   return c;   // incl. raw Latin-1 (¡ 0xA1, ¿ 0xBF, ´ 0xB4 …)
    }
}
// xAdvance (px) of a glyph in a VLW flash array, or -1 if the glyph is absent.
static int16_t vlwAdvance(const uint8_t* font, uint16_t uni) {
    uint16_t gCount = (uint16_t)vlwBE32(font);
    const uint8_t* m = font + 24;
    for (uint16_t i = 0; i < gCount; i++, m += 28)
        if ((uint16_t)vlwBE32(m) == uni) return (int16_t)(uint8_t)vlwBE32(m + 12);
    return -1;
}
// TFT_eSPI's guessed space width for a smooth font: (ascent + descent) * 2 / 7.
static int16_t vlwSpaceWidth(const uint8_t* font) {
    int16_t ascent  = (int16_t)vlwBE32(font + 16);
    int16_t descent = (int16_t)vlwBE32(font + 20);
    return (int16_t)(((ascent + descent) * 2) / 7);
}
// Pixel width of a private-code string in a VLW font — matches how TFT_eSPI
// advances the cursor (glyph xAdvance; spaceWidth for ' '; spaceWidth+1 if absent).
static int16_t vlwTextWidth(const uint8_t* font, const char* s) {
    int16_t sw = vlwSpaceWidth(font);
    int16_t w  = 0;
    for (const uint8_t* p = (const uint8_t*)s; *p; p++) {
        if (*p == ' ') { w += sw; continue; }
        int16_t a = vlwAdvance(font, vlwPrivToUnicode(*p));
        w += (a < 0) ? (int16_t)(sw + 1) : a;
    }
    return w;
}
// Convert a private-code string to UTF-8 so the VLW smooth-font drawString renders
// the real glyphs. Umlauts (U+00xx) → 2 bytes; typographic marks (U+20xx) → 3 bytes.
static void vlwPrivToUtf8(const char* in, char* out, size_t n) {
    size_t o = 0;
    for (const uint8_t* p = (const uint8_t*)in; *p && o + 4 < n; p++) {
        uint16_t u = vlwPrivToUnicode(*p);
        if (u < 0x80) {
            out[o++] = (char)u;
        } else if (u < 0x800) {
            out[o++] = (char)(0xC0 | (u >> 6));
            out[o++] = (char)(0x80 | (u & 0x3F));
        } else {
            out[o++] = (char)(0xE0 | (u >> 12));
            out[o++] = (char)(0x80 | ((u >> 6) & 0x3F));
            out[o++] = (char)(0x80 | (u & 0x3F));
        }
    }
    out[o] = 0;
}
// The reading-font array for a size index (font_num), from the active family.
// g_read_fraktur is set by loadToc from a "FONT|fraktur" line; cleared for Bible.
static const uint8_t* vlwForSize(uint8_t idx) {
    if (idx >= VLW_FONT_COUNT) idx = 3;
    return g_read_fraktur ? FRAK_FONTS[idx].data : VLW_FONTS[idx].data;
}
static uint8_t vlwLineH(uint8_t idx) {
    if (idx >= VLW_FONT_COUNT) idx = 3;
    return g_read_fraktur ? FRAK_FONTS[idx].lineH : VLW_FONTS[idx].lineH;
}

// Prettify a filename stem for display: '_' → ' ' and capitalize the first
// letter of each word (e.g. "lutherisches_gesangbuch" → "Lutherisches
// Gesangbuch", "web" → "Web"). The raw stem is still used for SD paths; this is
// display-only. Returns a pointer to a reusable static buffer — draw it before
// the next call (all current callers draw one row at a time).
static const char* prettyName(const char* stem) {
    static char buf[BIBLE_TRANS_LEN + 16];
    size_t n = 0;
    bool   word_start = true;
    for (const char* p = stem; *p && n < sizeof(buf) - 1; p++) {
        char c = (*p == '_') ? ' ' : *p;
        if (c == ' ') {
            word_start = true;
        } else {
            if (word_start && c >= 'a' && c <= 'z') c -= 32;  // capitalize word start
            word_start = false;
        }
        buf[n++] = c;
    }
    buf[n] = 0;
    return buf;
}

// Redraws only the list content area (rows + scrollbar) without touching the
// header or nav bar.  Called directly during scroll drag/fling so there is no
// full-screen repaint — eliminating the white/black flash between frames.
// Uses scroll_px for sub-item-height pixel accuracy.
// setViewport clips rows that extend into the header or nav bar zones; each row is
// pushed as one sprite blit so momentum scrolling is flicker-free.
void BibleInterface::redrawListContent(uint16_t item_count) {
    int16_t sub_px      = (int16_t)fmodf(scroll_px, (float)itemH());
    int16_t first       = (int16_t)(scroll_px / (float)itemH());
    int16_t content_top = (int16_t)contentY();
    int16_t content_end = content_top + (int16_t)contentH();

    // Each row is rendered off-screen and blitted atomically for flicker-free
    // scrolling (like the reading/search views). If the sprite can't be allocated
    // (very low heap) we fall back to direct drawListRow (correct, but rippled).
    TFT_eSprite row_spr(&tft);
    bool use_spr = row_spr.createSprite(scrW(), (int16_t)itemH());
    if (use_spr) row_spr.setTextWrap(false, false);
    const uint8_t* spr_font = nullptr;   // track the sprite's loaded font to skip reloads

    // Clip all draws to the content zone — prevents header/nav bleed. vpDatum=false
    // keeps screen-absolute coords so the partial top/bottom rows clip cleanly.
    tft.setViewport(0, contentY(), scrW(), contentH(), false);
    if (!use_spr) setUiFontEx(2, rowsFraktur());   // base font for the fallback path

    int16_t last_bottom = content_top;

    for (int i = 0; ; i++) {
        int16_t idx = first + i;
        int16_t y   = content_top - sub_px + i * (int16_t)itemH();
        if (y >= content_end || idx >= (int16_t)item_count) break;

        // Which row: text, selection, arrow, and whether it renders in the Fraktur
        // font (song list of a Fraktur book; per-row for bookmarks/search history).
        const char* text = nullptr;
        bool sel = false, has_arrow = true, row_frak = false;
        switch (view) {
            case BV_TRANS_SELECT:
                text = trans_names[idx]; sel = (idx == (int16_t)menu_sel); break;
            case BV_SECTION_SELECT:
                if (idx < (int16_t)numSecs()) { text = secName(idx); sel = (idx == (int16_t)menu_sel); }
                break;
            case BV_BOOK_SELECT:
                text = bookDisplay(secStart(cur_sec) + idx); sel = (idx == (int16_t)menu_sel);
                row_frak = rowsFraktur(); break;
            case BV_CHAPTER_SELECT:   // Dictionary page list
                text = pageLabel(idx); sel = (idx == (int16_t)menu_sel); has_arrow = false; break;
            case BV_BOOKMARKS:
                text = bookmarks[idx].label; sel = (idx == (int16_t)bm_sel); has_arrow = false;
                row_frak = bookmarkFraktur(idx); break;
            case BV_SEARCH_INPUT:
                text = search_hist[idx]; sel = (idx == (int16_t)search_hist_sel); has_arrow = false;
                row_frak = search_hist_frak[idx]; break;
            default: break;
        }

        if (text) {
            if (use_spr) {
                const uint8_t* f = (row_frak ? FRAKT_FONTS : VLW_FONTS)[2].data;
                if (f != spr_font) { row_spr.loadFont(f); spr_font = f; g_ui_vlw = f; }
                drawListRowSprite(row_spr, y, text, sel, has_arrow);
                row_spr.pushSprite(0, y);
                if (has_arrow) drawChevron(scrW() - 22, y, 16, itemH(), true, font_fg());
            } else {
                setUiFontEx(2, row_frak);
                drawListRow(y, text, sel, has_arrow);
            }
        }
        int16_t bot = y + (int16_t)itemH();
        if (bot > last_bottom) last_bottom = bot;
    }

    tft.resetViewport();
    if (use_spr) { row_spr.deleteSprite(); ui_font_idx = -1; }
    setUiFont(2);   // restore the normal UI font + g_ui_vlw

