H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    int16_t total_rows = ((int16_t)chaps + 4) / 5;
    drawScrollBar(total_rows, vis_rows, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Reading view — draws the paged verse text
// ─────────────────────────────────────────────────────────────────────────────
// (Re)load the VLW smooth font for the current size into the line sprite. The
// loaded font persists across createSprite/deleteSprite (only the destructor
// unloads it), so this only does real work when the size actually changes.
void BibleInterface::loadReadingFont() {
    uint8_t idx = (font_num < VLW_FONT_COUNT) ? font_num : 3;
    if (read_font_loaded == (int8_t)idx && read_font_frak == g_read_fraktur) return;
    line_spr.loadFont(vlwForSize(idx));        // normal or Fraktur; unloads previous first
    read_font_loaded = (int8_t)idx;
    read_font_frak   = g_read_fraktur;
}

// Load a smooth VLW size onto tft for the whole UI. While a font is loaded every
// TFT_eSPI text call (drawString/drawCentreString/drawChar/textWidth) renders with
// it, so menus, headers, nav, buttons and the keyboard all use the smooth font and
// its native umlaut glyphs. Big elements bump to a larger size and restore.
void BibleInterface::setUiFont(uint8_t idx) { setUiFontFam(idx, 0); }
void BibleInterface::setUiFontEx(uint8_t idx, bool frak_title) { setUiFontFam(idx, frak_title ? 1 : 0); }

// Load a UI VLW size onto tft from one of three families:
//   0 = normal (DejaVu)   1 = Fraktur title (FRAKT_FONTS)   2 = Fraktur body (FRAK_FONTS)
// The title family renders song/category/book titles of Fraktur songbooks in
// blackletter; the body family matches the reading view (used for search snippets).
void BibleInterface::setUiFontFam(uint8_t idx, uint8_t fam) {
    if (idx >= VLW_FONT_COUNT) idx = 2;
    if (ui_font_idx == (int8_t)idx && ui_font_fam == fam) return;
    const VlwFont* f = (fam == 2) ? FRAK_FONTS : (fam == 1) ? FRAKT_FONTS : VLW_FONTS;
    tft.loadFont(f[idx].data);
    g_ui_vlw    = f[idx].data;
    ui_font_idx = (int8_t)idx;
    ui_font_fam = fam;
}

// Fraktur is used ONLY for song titles and song text — never category or songbook
// names. So: the reading-view header (the open song's title) uses the Fraktur title
// font, and the song list (BV_BOOK_SELECT rows = song titles) uses it. Category
// names (BV_SECTION_SELECT rows), the songbook-name and category-name headers, and
// the picker all stay in the normal font.
bool BibleInterface::headerFraktur() const {
    return g_read_fraktur && mode == MODE_SONGS && view == BV_READING;
}
bool BibleInterface::rowsFraktur() const {
    return g_read_fraktur && mode == MODE_SONGS && view == BV_BOOK_SELECT;
}
// A songbook is a Fraktur book iff its file stem ends in "_fraktur" (enforced by
// generate_songs_xml.py). Lets search render/scope by Fraktur-ness without opening
// each .toc (which would clobber g_read_fraktur as a side effect).
bool BibleInterface::transIsFraktur(uint8_t t) const {
    if (mode != MODE_SONGS || t >= trans_count) return false;
    const char* s = trans_stems[t];
    size_t n = strlen(s);
    return n >= 8 && strcmp(s + n - 8, "_fraktur") == 0;
}
// A bookmark renders in the Fraktur font iff its songbook is Fraktur. Decided from
// the stored stem (robust to index shifts); legacy bookmarks fall back to trans.
bool BibleInterface::bookmarkFraktur(uint8_t idx) const {
    if (mode != MODE_SONGS) return false;
    const char* s = bookmarks[idx].stem;
    if (s[0]) {
        size_t n = strlen(s);
        return n >= 8 && strcmp(s + n - 8, "_fraktur") == 0;
    }
    return transIsFraktur(bookmarks[idx].trans);
}

void BibleInterface::drawReadingLines() {
    loadReadingFont();
    const uint8_t* vfont = vlwForSize(font_num);   // for verse-number width math
    int16_t  sub_px = (int16_t)fmodf(scroll_px, (float)lineH());
    int16_t  first  = (int16_t)(scroll_px / (float)lineH());
    uint8_t  vis    = visLines() + 1;   // +1 covers partial bottom row
    int16_t  cy     = (int16_t)contentY();
    int16_t  ce     = cy + (int16_t)contentH();
    uint16_t lh     = lineH();

    read_line = first;

    // Allocate one line-height sprite for atomic pushes — eliminates both the
    // per-line ripple (interleaved fill+draw) and the full-zone flash (single
    // big clear).  Each pushSprite() is a single SPI burst; the TFT viewport
    // clips any partial line at the header/nav boundaries.
    if (!line_spr.createSprite(scrW(), lh)) {
        // Allocation failed (very low heap) — fall back to direct draw.
        tft.startWrite();
        tft.fillRect(0, cy, scrW(), contentH(), bg());
        tft.endWrite();
        return;
    }
    line_spr.setTextWrap(false, false);   // one glyph line per sprite — never wrap

    tft.setViewport(0, cy, scrW(), contentH(), false);

    // Track current verse number for highlight support.
    // Scan backward from 'first' to find which verse that line belongs to.
    uint8_t cur_verse_num = 0;
    for (int16_t k = first; k >= 0; k--) {
        if (lines[k][0] == '^') {
            const char* pipe = strchr(lines[k] + 1, '|');
            if (pipe) { cur_verse_num = (uint8_t)atoi(lines[k] + 1); break; }
        }
    }
    // Highlight background — accent colour from Settings
    uint16_t hi_bg = sel_bg();

    // Precompute bookmark verse-range for this chapter (first matching verse bookmark).
    // Bookmark verse ranges are highlighted the same as search/selection highlights.
    uint8_t bm_v1 = 0, bm_v2 = 0;
    for (uint8_t k = 0; k < bm_count; k++) {
        // Scope to the current songbook (book indices repeat across songbooks).
        if (bookmarks[k].book == cur_book && bookmarks[k].chapter == cur_chapter
                && bookmarks[k].verse_first > 0
                && (mode == MODE_BIBLE || bookmarks[k].trans == cur_trans)) {
            bm_v1 = bookmarks[k].verse_first;
            bm_v2 = bookmarks[k].verse_last;
            break;  // show first matching range only
        }
    }

    for (uint8_t i = 0; i < vis; i++) {
        int16_t row_y    = cy - sub_px + (int16_t)i * (int16_t)lh;
        if (row_y >= ce) break;

        int16_t line_idx = first + (int16_t)i;

        // Update verse tracking before drawing
        if (line_idx >= 0 && line_idx < (int16_t)line_count) {
            const char* ln = lines[line_idx];
            if (ln[0] == '^') {
                const char* pipe = strchr(ln + 1, '|');
                if (pipe) cur_verse_num = (uint8_t)atoi(ln + 1);
            }
        }

        uint16_t line_bg = bg();
        if (highlight_verse > 0 && cur_verse_num == highlight_verse)
            line_bg = hi_bg;
        else if (sel_verse_first > 0
                 && cur_verse_num >= sel_verse_first
                 && cur_verse_num <= sel_verse_last)
            line_bg = hi_bg;
        else if (bm_v1 > 0
                 && cur_verse_num >= bm_v1
                 && cur_verse_num <= bm_v2)
            line_bg = hi_bg;

        line_spr.fillSprite(line_bg);

        if (line_idx >= 0 && line_idx < (int16_t)line_count) {
            const char* ln = lines[line_idx];
            char u8[BIBLE_LINE_BUF * 2];               // private codes → UTF-8 for the VLW font
            const int16_t txt_y = 1;                   // small top pad inside the line sprite
            // Smooth fonts render into a sprite via setCursor + printToSprite (the
            // sprite's own drawGlyph); drawString would draw to the physical TFT.
            if (ln[0] == '^') {
                const char* pipe = strchr(ln + 1, '|');
                if (pipe) {
                    char num_str[12];
                    int  n_len = (int)(pipe - (ln + 1));
                    if (n_len > 6) n_len = 6;
                    memcpy(num_str, ln + 1, n_len);
                    num_str[n_len]     = '.';
                    num_str[n_len + 1] = 0;
                    line_spr.setTextColor(verse_num_fg(), line_bg);
                    line_spr.setCursor(4, txt_y);
                    line_spr.printToSprite(num_str, strlen(num_str));
                    int16_t nx = vlwTextWidth(vfont, num_str);   // advance for content x
                    line_spr.setTextColor(font_fg(), line_bg);
                    line_spr.setCursor(4 + nx + 2, txt_y);
                    vlwPrivToUtf8(pipe + 1, u8, sizeof(u8));
                    line_spr.printToSprite(u8, strlen(u8));
                }
            } else {
                line_spr.setTextColor(font_fg(), line_bg);
                line_spr.setCursor(4, txt_y);
                vlwPrivToUtf8(ln, u8, sizeof(u8));
                line_spr.printToSprite(u8, strlen(u8));
            }
        }

        // pushSprite respects the viewport set above, clipping partial lines
        line_spr.pushSprite(0, row_y);
    }

    tft.resetViewport();
    line_spr.deleteSprite();
}

void BibleInterface::drawReading() {
    tft.fillScreen(bg());
    char hdr[56];
    if (mode == MODE_DICT) {
        // Dictionary: show the open page's word pair ("firstword - lastword").
        const char* pl = pageLabel(cur_chapter - 1);
        if (pl && pl[0]) snprintf(hdr, sizeof(hdr), "%s", pl);
        else             snprintf(hdr, sizeof(hdr), "%s p%d", bookDisplay(cur_book), cur_chapter);
    } else if (bookChapters(cur_book) <= 1) {
        // Single-chapter books (Songs) show just the title — no redundant " 1".
        snprintf(hdr, sizeof(hdr), "%s", bookDisplay(cur_book));
    } else {
        snprintf(hdr, sizeof(hdr), "%s %d", bookDisplay(cur_book), cur_chapter);
    }
    drawHeader(hdr);
    drawReadingLines();
    drawNavBar("Marks", "Settings", "+Mark");
}

// ─────────────────────────────────────────────────────────────────────────────
// Settings screen
// ─────────────────────────────────────────────────────────────────────────────
// Settings row indices (kept in sync with handleSettingsInput):
//   0 Font Size · 1 Font Color · 2 Verse # Color · 3 Theme · 4 Brightness
//   5 Song Book/Translation/Dictionary · 6 Highlight · 7 Orientation
//   8 About · 9 Boot OTA_1 · 10 Calibrate Touch (resistive only)
static const char* const SCOPE_NAMES[5] = { "Global", "Main Menu", "Bible", "Songs", "Dictionary" };

// Representative NVS namespace used to READ a scope's settings.
static const char* scopeReadNs(uint8_t scope) {
    switch (scope) {
        case 2: return "bible";
        case 3: return "songs";
        case 4: return "dict";
        default: return "menu";   // Global / Main Menu
    }
}

uint8_t BibleInterface::settingsScopeMode() const {
    switch (settings_scope) {
        case 2: return MODE_BIBLE;
        case 3: return MODE_SONGS;
        case 4: return MODE_DICT;
        default: return 0xFF;     // Global / Main Menu have no translation
    }
}

void BibleInterface::buildSettingsRows() {
    uint8_t k = 0;
    set_rows[k++] = SR_SCOPE;
    if (settingsScopeMode() != 0xFF) set_rows[k++] = SR_TRANS;   // Translation near the top
    set_rows[k++] = SR_FONTSIZE;
    set_rows[k++] = SR_FONTCOL;
    set_rows[k++] = SR_VNUMCOL;
    set_rows[k++] = SR_THEME;
    set_rows[k++] = SR_HIGHLIGHT;
    set_rows[k++] = SR_ORIENT;
    set_rows[k++] = SR_BRIGHT;
    set_rows[k++] = SR_ABOUT;                                    // just above Boot
    set_rows[k++] = SR_BOOT;
#ifndef HAS_CAP_TOUCH
    set_rows[k++] = SR_CALIB;
#endif
    set_row_n = k;
}

// Write one "look" setting to every NVS namespace covered by the current scope
// (Global = all modes + menu; otherwise just the scope's namespace).
void BibleInterface::writeScoped(const char* key, uint8_t val) {
    static const char* const ALL[] = { "bible", "songs", "dict", "menu" };
    // persistU8 avoids the second-RW-open collision that silently dropped writes to
    // the namespace the member `prefs` already holds (e.g. "menu" in the Main Menu).
    if (settings_scope == 0)             // Global → every mode + menu
        for (uint8_t i = 0; i < 4; i++) persistU8(ALL[i], key, val);
    else
        persistU8(scopeReadNs(settings_scope), key, val);
}

// Load the scope's "look" settings into the live member vars (also previews the
// scope on the settings screen). Brightness/orientation are global (excluded).
void BibleInterface::loadScopeSettings() {
    const char* ns = scopeReadNs(settings_scope);
    theme_idx      = readU8(ns, "theme",    0);
    accent_idx     = readU8(ns, "accent",   0);
    accent_def     = (readU8(ns, "accentdef", 0) != 0);
    font_num       = readU8(ns, "font",     3);
    font_color_idx = readU8(ns, "fontcol",  0);
    vnum_color_idx = readU8(ns, "vnumcol",  0);
    if (theme_idx      >= THEME_COUNT)      theme_idx = 0;
    if (accent_idx     >= ACCENT_COUNT)     accent_idx = 0;
    if (font_num >= VLW_FONT_COUNT) font_num = 3;   // VLW reading-size index; 3 = Medium
    if (font_color_idx >= FONT_COLOR_COUNT) font_color_idx = 0;
    if (vnum_color_idx >= FONT_COLOR_COUNT) vnum_color_idx = 0;
    dark_mode = THEMES[theme_idx].dark;
}

// Scan the scope mode's SD folder for translations into sc_trans[], and set
// sc_trans_cur from that scope's saved "trans" index.
void BibleInterface::scopeScanTrans() {
    sc_trans_count = 0; sc_trans_cur = 0;
    uint8_t m = settingsScopeMode();
    if (m == 0xFF) return;
    const char* base = (m == MODE_SONGS) ? SONGS_SD_BASE
                     : (m == MODE_DICT)  ? DICT_SD_BASE : BIBLE_SD_BASE;
    File root = SD.open(base);
    if (root) {
        while (sc_trans_count < BIBLE_MAX_TRANS) {
            File e = root.openNextFile();
            if (!e) break;
            if (e.isDirectory()) { e.close(); continue; }
            String name = e.name(); e.close();
            name.toLowerCase();
            if (!name.endsWith(".xml")) continue;
            int slash = name.lastIndexOf('/'); if (slash >= 0) name = name.substring(slash + 1);
            String stem = name.substring(0, name.length() - 4);
            strncpy(sc_trans[sc_trans_count], stem.c_str(), BIBLE_TRANS_LEN - 1);
            sc_trans[sc_trans_count][BIBLE_TRANS_LEN - 1] = 0;
            sc_trans_count++;
        }
        root.close();
    }
    for (uint8_t i = 0; i + 1 < sc_trans_count; i++)
        for (uint8_t j = i + 1; j < sc_trans_count; j++)
            if (strcmp(sc_trans[j], sc_trans[i]) < 0) {
                char t[BIBLE_TRANS_LEN];
                strncpy(t, sc_trans[i], BIBLE_TRANS_LEN);
                strncpy(sc_trans[i], sc_trans[j], BIBLE_TRANS_LEN);
                strncpy(sc_trans[j], t, BIBLE_TRANS_LEN);
            }
    for (uint8_t i = 0; i < sc_trans_count; i++)
        transDisplayName(base, sc_trans[i], sc_trans_names[i], BIBLE_TRANS_DISP_LEN);
    uint8_t cur = readU8(scopeReadNs(settings_scope), "trans", 0);
    sc_trans_cur = (cur < sc_trans_count) ? cur : 0;
}

void BibleInterface::redrawSettingsContent() {
    const uint8_t  vis   = visItems();
    const int16_t  btn_w = 28, btn_h = 22, btn_r = 4;

    // Pixel-accurate scroll (same momentum machinery as the other lists).
    int16_t sub_px      = (int16_t)fmodf(scroll_px, (float)itemH());
    int16_t first       = (int16_t)(scroll_px / (float)itemH());
    int16_t content_top = (int16_t)contentY();
    int16_t content_end = content_top + (int16_t)contentH();

    tft.startWrite();
    tft.setViewport(0, contentY(), scrW(), contentH(), false);

    // [<] Name [>] choice row. name_col = colour to draw the value text in
    // (0 = default fg). Font/Verse colour rows pass the actual colour so the user
    // previews it; others pass 0.
    auto choiceRow = [&](int16_t row_y, const char* label, const char* name,
                         bool sel, uint16_t name_col) {
        drawListRow(row_y, label, sel, false);
        uint16_t bg_c  = sel ? sel_bg() : bg();
        int16_t  btn_y = row_y + (itemH() - btn_h) / 2;
        int16_t  txt_y = btn_y + (btn_h - 16) / 2;
        int16_t  nam_y = row_y + (itemH() - 16) / 2;
        int16_t  fwd_bx = (int16_t)scrW() - 9 - btn_w;   // -9 clears the 6px scrollbar
        int16_t  eseed = row_y / (int16_t)itemH();
        tft.fillRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed, dim_fg()));
        drawChevron(fwd_bx, btn_y, btn_w, btn_h, true, font_fg());
        int16_t nam_w = (int16_t)tft.textWidth(name, 2);
        int16_t nam_x = fwd_bx - 4 - nam_w;
        tft.setTextColor(name_col ? name_col : fg(), bg_c);
        tft.drawString(name, nam_x, nam_y, 2);
        int16_t bwd_bx = nam_x - 4 - btn_w;
        tft.fillRoundRect(bwd_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(bwd_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed + 4, dim_fg()));
        drawChevron(bwd_bx, btn_y, btn_w, btn_h, false, font_fg());
    };
    // Translation row: the value can be long, so instead of letting it push the
    // [<] button onto the "Translation" label, the two selectors bracket a fixed
    // ~11-character window and the value text scrolls (marquee) inside it.
    auto transRow = [&](int16_t row_y, const char* label, const char* name, bool sel) {
        drawListRow(row_y, label, sel, false);
        uint16_t bg_c   = sel ? sel_bg() : bg();
        int16_t  btn_y  = row_y + (itemH() - btn_h) / 2;
        int16_t  txt_y  = btn_y + (btn_h - 16) / 2;
        int16_t  nam_y  = row_y + (itemH() - 16) / 2;
        int16_t  fwd_bx = (int16_t)scrW() - 9 - btn_w;
        int16_t  eseed  = row_y / (int16_t)itemH();
        // [>]
        tft.fillRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed, dim_fg()));
        drawChevron(fwd_bx, btn_y, btn_w, btn_h, true, font_fg());
        // Fixed window (~11 chars) for [<], but never let it overlap the label.
        int16_t want_w  = (int16_t)tft.textWidth("Translation", 2);   // 11-char reference
        int16_t label_w = (int16_t)tft.textWidth(label, 2);
        int16_t bwd_des = fwd_bx - 4 - want_w - 4 - btn_w;
        int16_t bwd_min = 10 + label_w + 8;        // sit just right of the label
        int16_t bwd_bx  = bwd_des > bwd_min ? bwd_des : bwd_min;
        // [<]
        tft.fillRoundRect(bwd_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(bwd_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed + 4, dim_fg()));
        drawChevron(bwd_bx, btn_y, btn_w, btn_h, false, font_fg());
        // Value window between the inner edges of the two buttons.
        int16_t win_left = bwd_bx + btn_w + 4;
        int16_t win_w    = (fwd_bx - 4) - win_left;
        if (win_w < 8) win_w = 8;
        int16_t textw = (int16_t)tft.textWidth(name, 2);
        if (strncmp(trans_marq_str, name, sizeof(trans_marq_str)) != 0) {
            strncpy(trans_marq_str, name, sizeof(trans_marq_str) - 1);
            trans_marq_str[sizeof(trans_marq_str) - 1] = '\0';
            trans_marq_off = 0;
            trans_marq_ms  = millis();
        }
        trans_marq_winx  = win_left;
        trans_marq_winy  = row_y;
        trans_marq_winw  = win_w;
        trans_marq_texty = nam_y;
        trans_marq_textw = textw;
        trans_marq_bg    = bg_c;
        trans_marq_fg    = fg();
        trans_marq_on    = (textw > win_w);
        drawTransValue(trans_marq_on ? trans_marq_off : 0);
    };
    auto brightRow = [&](int16_t row_y, bool sel) {
        drawListRow(row_y, "Brightness", sel, false);
        uint16_t bg_c  = sel ? sel_bg() : bg();
        int16_t  btn_y = row_y + (itemH() - btn_h) / 2;
        int16_t  txt_y = btn_y + (btn_h - 16) / 2;
        int16_t  num_y = row_y + (itemH() - 16) / 2;
        int16_t  eseed = row_y / (int16_t)itemH();
        int16_t plus_bx = (int16_t)scrW() - 9 - btn_w;
        tft.fillRoundRect(plus_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(plus_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed, dim_fg()));
        drawPlusMinus(plus_bx, btn_y, btn_w, btn_h, true, font_fg());
        char nbuf[8];
        snprintf(nbuf, sizeof(nbuf), "%d/20", bl_idx + 1);
        int16_t num_w = (int16_t)tft.textWidth(nbuf, 2);
        int16_t num_x = plus_bx - 4 - num_w;
        tft.setTextColor(fg(), bg_c);
        tft.drawString(nbuf, num_x, num_y, 2);
        int16_t minus_bx = num_x - 4 - btn_w;
        tft.fillRoundRect(minus_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
        tft.drawRoundRect(minus_bx, btn_y, btn_w, btn_h, btn_r, edgeColor(eseed + 4, dim_fg()));
        drawPlusMinus(minus_bx, btn_y, btn_w, btn_h, false, font_fg());
    };

    // Cleared each pass; transRow re-asserts it only if the Translation row is
    // actually drawn and overflowing, so a scrolled-off row stops the marquee.
    trans_marq_on = false;

    int16_t last_bottom = content_top;
    for (int vi = 0; ; vi++) {
        int16_t i     = first + vi;
        int16_t row_y = content_top - sub_px + vi * (int16_t)itemH();
        if (row_y >= content_end || i >= (int16_t)set_row_n) break;
        bool sel = (i == (int16_t)menu_sel);

