H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
        switch (set_rows[i]) {
            case SR_SCOPE:
                choiceRow(row_y, "Settings Scope", SCOPE_NAMES[settings_scope], sel, 0);
                break;
            case SR_TRANS: {
                uint8_t sm = settingsScopeMode();
                const char* tl = (sm == MODE_SONGS) ? "Song Book"
                               : (sm == MODE_DICT)  ? "Dictionary" : "Translation";
                transRow(row_y, tl, sc_trans_count > 0 ? sc_trans_names[sc_trans_cur] : "-", sel);
                break;
            }
            case SR_FONTSIZE: {
                static const char* const SZ_NAMES[6] = { "Tiny", "X-Small", "Small",
                                                         "Medium", "Large", "X-Large" };
                uint8_t si = (font_num < VLW_FONT_COUNT && font_num < 6) ? font_num : 3;
                choiceRow(row_y, "Font Size", SZ_NAMES[si], sel, 0);
                break;
            }
            case SR_FONTCOL:   choiceRow(row_y, "Font Color",    FONT_COLOR_NAMES[font_color_idx], sel, font_fg());       break;
            case SR_VNUMCOL:   choiceRow(row_y, "Verse # Color", FONT_COLOR_NAMES[vnum_color_idx], sel, verse_num_fg()); break;
            case SR_THEME:     choiceRow(row_y, "Theme",         THEMES[theme_idx].name,           sel, 0);              break;
            case SR_HIGHLIGHT: choiceRow(row_y, "Highlight", accent_def ? "Default" : ACCENT_NAMES[accent_idx], sel, 0); break;
            case SR_ORIENT:    choiceRow(row_y, "Orientation",   ORIENT_NAMES[orientation & 3],    sel, 0);              break;
            case SR_BRIGHT:    brightRow(row_y, sel); break;
            case SR_ABOUT:     drawListRow(row_y, "About",           sel, false); break;
            case SR_BOOT:      drawListRow(row_y, "Boot OTA_1",      sel, false); break;
            case SR_CALIB:     drawListRow(row_y, "Calibrate Touch", sel, false); break;
        }
        int16_t bot = row_y + (int16_t)itemH();
        if (bot > last_bottom) last_bottom = bot;
    }

    if (last_bottom < content_end)
        tft.fillRect(0, last_bottom, scrW(), content_end - last_bottom, bg());

    tft.resetViewport();
    drawScrollBar((int16_t)set_row_n, vis, first);
    tft.endWrite();
}

// Draws the Translation value text into its window at horizontal scroll `off`,
// clipped to the window via a temporary viewport. Used for both the static draw
// and the marquee tick. Must be called inside a startWrite()/endWrite() pair.
void BibleInterface::drawTransValue(int16_t off) {
    const int16_t GAP = 24;
    // Clip to just this row's band (intersected with the content area) — NOT the
    // whole content height, or it paints a tall bar over the other rows' column.
    // Stop 3 pixels short of the bottom so the row's divider line is preserved.
    int16_t top = trans_marq_winy;
    int16_t bot = trans_marq_winy + (int16_t)itemH() - 3;
    int16_t cy0 = (int16_t)contentY();
    int16_t cy1 = cy0 + (int16_t)contentH();
    if (top < cy0) top = cy0;
    if (bot > cy1) bot = cy1;
    int16_t h = bot - top;
    if (h <= 0) return;
    tft.setViewport(trans_marq_winx, top, trans_marq_winw, h, false);
    tft.fillRect(trans_marq_winx, top, trans_marq_winw, h, trans_marq_bg);
    // tftCharUTF8 fills each glyph cell with the current text bg colour, so set it
    // to the row background here or the text sits on a stale (button) colour.
    tft.setTextColor(trans_marq_fg, trans_marq_bg);
    int16_t x0 = trans_marq_winx - off;
    int16_t tx = x0;
    for (const char* p = trans_marq_str; *p; p++)
        tx += tftCharUTF8(tft, (uint8_t)*p, tx, trans_marq_texty, 2, trans_marq_fg);
    if (trans_marq_on) {                       // second copy for a seamless wrap
        int16_t tx2 = x0 + trans_marq_textw + GAP;
        int16_t end = trans_marq_winx + trans_marq_winw;
        for (const char* p = trans_marq_str; *p && tx2 < end; p++)
            tx2 += tftCharUTF8(tft, (uint8_t)*p, tx2, trans_marq_texty, 2, trans_marq_fg);
    }
    tft.setViewport(0, contentY(), scrW(), contentH(), false);  // restore content clip
}

// Advances the Translation marquee slowly and redraws just its window. Called
// every loop while the Settings view is idle (no drag/fling/press in progress).
void BibleInterface::tickTransMarquee() {
    if (!trans_marq_on) return;
    if (scroll_dragging || fling_active || touch_was_down) return;
    uint32_t now = millis();
    uint32_t interval = (trans_marq_off == 0) ? 900 : 55;   // dwell at start, then ~18 px/s
    if (now - trans_marq_ms < interval) return;
    trans_marq_ms = now;
    trans_marq_off += 1;
    if (trans_marq_off >= trans_marq_textw + 24) trans_marq_off = 0;  // wrap (GAP)
    tft.startWrite();
    drawTransValue(trans_marq_off);
    tft.resetViewport();   // don't leave the content clip set for the next view's redraw
    tft.endWrite();
}

void BibleInterface::drawSettings() {
    tft.fillScreen(bg());
    drawHeader("Settings");
    redrawSettingsContent();
    // Footer: show a "Menu" button (bottom-right) only when opened from a mode.
    drawNavBar("Back", "", settings_from_menu ? "" : "Menu");
}

// ─────────────────────────────────────────────────────────────────────────────
// Bookmarks screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawBookmarks() {
    tft.fillScreen(bg());
    drawHeader("Bookmarks");
    if (bm_count == 0) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("No bookmarks yet", scrW()/2, contentY() + 20, 2);
        drawNavBar("Back", "", "");
        return;
    }
    uint8_t vis = visItems();
    for (uint8_t i = 0; i < vis && (bm_scroll + i) < bm_count; i++) {
        uint8_t idx = bm_scroll + i;
        bool sel = idx == (uint8_t)bm_sel;
        // A bookmark label is a song title — render Fraktur if its songbook is.
        setUiFontEx(2, bookmarkFraktur(idx));
        drawListRow(contentY() + i * itemH(), bookmarks[idx].label, sel, false);
    }
    setUiFont(2);   // restore normal UI font for scrollbar/nav
    drawScrollBar(bm_count, vis, bm_scroll);
    drawNavBar("Back", "View", "Del");
    if (bm_confirm_pending) drawConfirmDelete();
}

// Delete-confirmation popup — drawn on top of the bookmark list.
// Geometry is computed from scrW()/scrH() so it scales for both boards.
//
//  ┌─────────────────────────────────┐
//  │       Delete bookmark?          │
//  │                                 │
//  │  [ Cancel ]       [ Delete ]    │
//  └─────────────────────────────────┘
//
// Touch detection: lift inside the Delete button confirms; anywhere else cancels.
void BibleInterface::drawConfirmDelete() {
    int16_t pop_w = (int16_t)scrW() - 40;   // 20 px margin each side
    int16_t pop_h = 80;
    int16_t pop_x = 20;
    int16_t pop_y = (int16_t)(scrH() / 2) - 40;

    // Panel — filled with bg() so it covers content behind it
    tft.fillRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, bg());
    tft.drawRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, dim_fg());
    tft.drawRoundRect(pop_x + 1, pop_y + 1, pop_w - 2, pop_h - 2, 6, dim_fg());

    // Message
    tft.setTextColor(fg(), bg());
    tft.drawCentreString("Delete bookmark?", scrW() / 2, pop_y + 10, 2);

