H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
#ifndef HAS_CAP_TOUCH
// Run the TFT_eSPI resistive-touch calibration wizard.
// Loops until the user correctly taps a verification circle, then saves
// the resulting 5-word calibration array to Preferences ("tcal2"/"tcald2").
// blInit() must have been called before this so the LEDC channel is attached.
void BibleInterface::runTouchCalibration() {
    // Force full brightness — stored level may be very low.
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(TFT_BL, 255);
#else
    ledcWrite(0, 255);
#endif
    // Always calibrate in PORTRAIT (rotation 0) so the stored calibration is
    // orientation-independent; touch is then rotated in software (resistiveTouch).
    uint8_t saved_ori = orientation;
    orientation = 0;
    applyOrientation();

    bool success = false;
    while (!success) {
        // ── Instructions screen ──────────────────────────────────────────
        tft.fillScreen(TFT_BLACK);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawCentreString("Touch Calibration", scrW() / 2, scrH() / 2 - 20, 2);
        tft.drawCentreString("Tap each + marker", scrW() / 2, scrH() / 2 +  5, 2);
        delay(2000);

        // ── 4-corner calibration ─────────────────────────────────────────
        uint16_t calData[5];
        tft.calibrateTouch(calData, TFT_WHITE, TFT_BLACK, 15);
        tft.setTouch(calData);  // apply immediately for verification
        memcpy(cal_data, calData, sizeof(cal_data));  // for manual orientation mapping

        // ── Verification: tap the green circle ───────────────────────────
        int16_t cx = scrW() / 2;
        int16_t cy = scrH() / 2 + 20;
        tft.fillScreen(TFT_BLACK);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawCentreString("Tap the circle", scrW() / 2, cy - 55, 2);
        tft.drawCircle(cx, cy, 22, TFT_GREEN);
        tft.fillCircle(cx, cy,  8, TFT_GREEN);

        uint16_t vx = 0, vy = 0;
        bool tapped = false;
        uint32_t t0 = millis();
        while (millis() - t0 < 6000) {
            if (tft.getTouch(&vx, &vy, 600)) { tapped = true; break; }
            delay(20);
        }

        if (tapped && abs((int16_t)vx - cx) < 35 && abs((int16_t)vy - cy) < 35) {
            // ── Good — save ───────────────────────────────────────────────
            prefs.putBytes("tcald2", calData, sizeof(calData));
            prefs.putUChar("tcal2", 1);
            success = true;
        } else {
            // ── Bad or timeout — try again ────────────────────────────────
            tft.fillScreen(TFT_BLACK);
            tft.setTextColor(TFT_RED, TFT_BLACK);
            tft.drawCentreString("Calibration failed", scrW() / 2, scrH() / 2 - 8, 2);
            tft.drawCentreString("Try again...",       scrW() / 2, scrH() / 2 + 16, 2);
            delay(2000);
        }
    }

    // Restore orientation and the user's saved brightness level.
    orientation = saved_ori;
    applyOrientation();
    blSet(bl_idx);
    tft.fillScreen(bg());
}
#endif
bool BibleInterface::touchInNav(uint16_t /*x*/, uint16_t y) {
    return y >= (scrH() - navH());
}
int16_t BibleInterface::touchItem(uint16_t /*x*/, uint16_t y) {
    if (y < contentY() || y >= (scrH() - navH())) return -1;
    return (int16_t)((y - contentY()) / itemH());
}

// ─────────────────────────────────────────────────────────────────────────────
// Input handlers
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::handleListInput(uint16_t item_count) {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched down ─────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        // Header and nav bar fire immediately on press — no drag ambiguity there
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if      (tx > scrW() - scrW()/3) { blCycle(); needs_redraw = true; }
            else if (tx < scrW()/3)           { goToBookmarks(); }
            else                               { goToSettings(); }
            return;
        }
        // Highlight the touched item immediately for press feedback
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && (menu_scroll + hi) < (int16_t)item_count) {
            menu_sel = menu_scroll + hi;
            redrawListContent(item_count);
        }
        return;
    }

    // ── Finger held — pixel-accurate drag ────────────────────────────────────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
            menu_sel = -1;  // clear press highlight when drag begins
        }
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)item_count - (int)visItems()) * (float)itemH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px   = new_px;
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            recordVel((int16_t)ty, millis());
            redrawListContent(item_count);
        }
        return;
    }

    // ── Finger lifted ────────────────────────────────────────────────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            // Kick fling if lift velocity is fast enough
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }

        // It was a tap — navigate to the item highlighted on press
        if (menu_sel < 0 || menu_sel >= (int16_t)item_count) return;

        switch (view) {
            case BV_TRANS_SELECT:
                selectTranslation((uint16_t)menu_sel);
                break;
            case BV_SECTION_SELECT:
                goToBook((int16_t)menu_sel);
                break;
            case BV_BOOK_SELECT:
                goToChapter(secStart(cur_sec) + (int16_t)menu_sel);
                break;
            case BV_CHAPTER_SELECT:
                goToReading((int16_t)menu_sel + 1);
                break;
            default: break;
        }
    }
}

void BibleInterface::handleChapterInput() {
    uint16_t  chaps      = bookChapters(cur_book);
    uint16_t tile_w     = scrW() / 5;
    uint16_t tile_h     = 36;
    uint8_t  vis_rows   = (uint8_t)(contentH() / tile_h);
    int16_t  total_rows = ((int16_t)chaps + 4) / 5;
    int16_t  max_scroll = max((int16_t)0, (int16_t)(total_rows - vis_rows));

    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

