H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = (float)menu_scroll * (float)tile_h;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if      (tx > scrW() - scrW()/3) { blCycle(); needs_redraw = true; }
            else if (tx < scrW()/3)           { goToBookmarks(); }
            else                               { goToSettings(); }
            return;
        }
        // Highlight the touched chapter tile immediately for press feedback
        if (ty >= (uint16_t)contentY() && ty < (uint16_t)(scrH() - navH())) {
            uint8_t col_p = (uint8_t)(tx / tile_w);
            uint8_t row_p = (uint8_t)((ty - contentY()) / tile_h);
            uint16_t ch_p  = (uint16_t)((menu_scroll + row_p) * 5 + col_p + 1);
            if (ch_p >= 1 && ch_p <= chaps) {
                menu_sel = (int16_t)ch_p;
                redrawChapterContent();
            }
        }
        return;
    }

    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 12) {
            scroll_dragging = true;
            menu_sel = -1;  // clear tile highlight when drag begins
        }
        if (scroll_dragging) {
            // Chapter grid stays quantized during drag
            float raw_px   = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            float max_px   = (float)max_scroll * (float)tile_h;
            if (raw_px < 0.f) raw_px = 0.f;
            if (raw_px > max_px) raw_px = max_px;
            scroll_px = raw_px;
            int16_t new_scroll = (int16_t)(scroll_px / (float)tile_h);
            recordVel((int16_t)ty, millis());
            if (new_scroll != menu_scroll) {
                menu_scroll = new_scroll;
                redrawChapterContent();
            }
        }
        return;
    }

    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }

        // Navigate to the chapter highlighted on press
        if (menu_sel < 1 || menu_sel > (int16_t)chaps) return;
        goToReading((int16_t)menu_sel);
    }
}

void BibleInterface::handleReadingInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

#ifdef ENABLE_VERSE_BROADCAST
    // ── Broadcast-verse popup ─────────────────────────────────────────────────
    // While visible, block reading input; act on a tap in WiFi / Bluetooth / Cancel.
    if (bcast_pending) {
        if (down && !touch_was_down) {
            touch_was_down = true;
            touch_down_x = tx; touch_down_y = ty;   // pollTouch has no coords on lift
        } else if (!down && touch_was_down) {
            touch_was_down = false;
            // Geometry must match drawBroadcastMenu().
            int16_t pop_w  = (int16_t)scrW() - 40;
            int16_t pop_x  = 20;
            int16_t pop_y  = (int16_t)(scrH() / 2) - 54;
            int16_t btn_h  = 28;
            int16_t half_w = pop_w / 2 - 6;
            int16_t r1_y   = pop_y + 34;
            int16_t wifi_x = pop_x + 4;
            int16_t bt_x   = pop_x + pop_w / 2 + 2;
            int16_t r2_y   = pop_y + 70;
            int16_t dx = (int16_t)touch_down_x, dy = (int16_t)touch_down_y;
            bool hit_row1 = (dy >= r1_y && dy < r1_y + btn_h);
            bool hit_wifi = hit_row1 && (dx >= wifi_x && dx < wifi_x + half_w);
            bool hit_bt   = hit_row1 && (dx >= bt_x   && dx < bt_x   + half_w);
            // (Cancel, or a tap anywhere else, just closes the popup.)
            bcast_pending = false;
            if (hit_wifi)      { runVerseBroadcast(true);  }
            else if (hit_bt)   { runVerseBroadcast(false); }
            needs_redraw = true;
        }
        return;
    }
#endif

    // ── Finger just touched ────────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            uint16_t third = scrW() / 3;
            if (tx < third)      { goToBookmarks();      return; }
            if (tx < 2 * third)  { goToSettings();       return; }
            addBookmarkCurrent(); return;
        }
        return;
    }

    // ── Finger held down — pixel-accurate drag ────────────────────────────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) scroll_dragging = true;
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)line_count - (int)visLines()) * (float)lineH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px = new_px;
            recordVel((int16_t)ty, millis());
            drawReadingLines();  // updates read_line internally from scroll_px
        }
        return;
    }

