H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // ── Finger lifted ─────────────────────────────────────────────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }
        // Tap without drag ─────────────────────────────────────────────────
        // If tap is in the verse-number column (x < 55) and in the content
        // area, toggle verse selection instead of doing page navigation.
        if ((int16_t)touch_down_x < 55
                && (int16_t)touch_down_y >= (int16_t)contentY()
                && (int16_t)touch_down_y < (int16_t)(contentY() + contentH())) {
            // Determine which line was tapped
            int16_t sub_px   = (int16_t)fmodf(scroll_px, (float)lineH());
            int16_t first_ln = (int16_t)(scroll_px / (float)lineH());
            int16_t row_off  = ((int16_t)touch_down_y - (int16_t)contentY() + sub_px) / (int16_t)lineH();
            int16_t line_idx = first_ln + row_off;

            // Scan backward from tapped line to find the owning verse number
            uint8_t v = 0;
            for (int16_t k = line_idx; k >= 0; k--) {
                if (k < (int16_t)line_count && lines[k][0] == '^') {
                    const char* pipe = strchr(lines[k] + 1, '|');
                    if (pipe) { v = (uint8_t)atoi(lines[k] + 1); break; }
                }
            }

            if (v > 0) {
                if (sel_verse_first == 0) {
                    // Nothing selected → select this verse
                    sel_verse_first = sel_verse_last = v;
                } else if (v >= sel_verse_first && v <= sel_verse_last) {
                    // Tap on already-selected verse
                    if (sel_verse_first == sel_verse_last) {
                        sel_verse_first = sel_verse_last = 0;  // deselect single
                    } else if (v == sel_verse_first) {
                        sel_verse_first++;                      // shrink from start
                    } else if (v == sel_verse_last) {
                        sel_verse_last--;                       // shrink from end
                    } else {
                        sel_verse_first = sel_verse_last = v;  // middle → reset to this
                    }
                } else if (v == sel_verse_last + 1) {
                    sel_verse_last = v;                         // extend end
                } else if (v + 1 == sel_verse_first) {
                    sel_verse_first = v;                        // extend start
                } else {
                    sel_verse_first = sel_verse_last = v;       // non-adjacent → reset
                }
                drawReadingLines();
                return;
            }
        }

#ifdef ENABLE_VERSE_BROADCAST
        // Tap on the TEXT (x >= 55) of a currently-selected verse → broadcast popup.
        if (sel_verse_first > 0
                && (int16_t)touch_down_x >= 55
                && (int16_t)touch_down_y >= (int16_t)contentY()
                && (int16_t)touch_down_y < (int16_t)(contentY() + contentH())) {
            int16_t sub_px   = (int16_t)fmodf(scroll_px, (float)lineH());
            int16_t first_ln = (int16_t)(scroll_px / (float)lineH());
            int16_t row_off  = ((int16_t)touch_down_y - (int16_t)contentY() + sub_px) / (int16_t)lineH();
            int16_t line_idx = first_ln + row_off;
            uint8_t v = 0;
            for (int16_t k = line_idx; k >= 0; k--) {
                if (k < (int16_t)line_count && lines[k][0] == '^') {
                    const char* pipe = strchr(lines[k] + 1, '|');
                    if (pipe) { v = (uint8_t)atoi(lines[k] + 1); break; }
                }
            }
            if (v >= sel_verse_first && v <= sel_verse_last) {
                bcast_pending = true;
                drawBroadcastMenu();
                return;
            }
        }
#endif

        // Upper half = previous page/chapter, lower = next
        uint16_t mid = scrH() / 2;
        if (touch_down_y < mid) {
            int16_t prev = read_line - (int16_t)visLines();
            if (prev >= 0) {
                scroll_px = (float)prev * (float)lineH();
                drawReadingLines();
            } else if (scroll_px > 0.f) {
                scroll_px = 0.f;
                drawReadingLines();
            } else if (cur_chapter > 1) {
                goToReading(cur_chapter - 1);
            }
        } else {
            int16_t next = read_line + (int16_t)visLines();
            if (next < (int16_t)line_count) {
                scroll_px = (float)next * (float)lineH();
                drawReadingLines();
            } else if (cur_chapter < bookChapters(cur_book)) {
                goToReading(cur_chapter + 1);
            }
        }
    }
}

void BibleInterface::handleSettingsInput() {
    const uint8_t SETTINGS_N = set_row_n;
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched down ──────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        // Header and nav fire immediately on press (no drag ambiguity)
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (!settings_from_menu && touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if (tx < scrW()/3) goBack();
            else if (tx > 2 * (scrW()/3) && !settings_from_menu) goToMainMenu();  // footer Menu
            return;
        }
        // Highlight touched (absolute) row immediately for press feedback.
        int16_t row = (int16_t)((scroll_px + (float)((int16_t)ty - (int16_t)contentY())) / (float)itemH());
        if (row >= 0 && row < (int16_t)SETTINGS_N) {
            menu_sel = row;
            redrawSettingsContent();
        }
        return;
    }

