H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // ── Finger held — pixel-accurate drag ────────────────────────────────────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
            bm_sel = -1;  // clear press highlight when drag begins
        }
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)bm_count - (int)visItems()) * (float)itemH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px = new_px;
            bm_scroll = (int16_t)(scroll_px / (float)itemH());
            recordVel((int16_t)ty, millis());
            redrawListContent(bm_count);
        }
        return;
    }

    // ── Finger lifted ────────────────────────────────────────────────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }

        // Tap selects the bookmark; navigation is via the "View" button.
        // Nothing else to do on lift — selection was set on press.
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Navigation helpers
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::goToTransSelect() {
    stopFling();
    view     = BV_TRANS_SELECT;
    menu_sel = (int16_t)cur_trans;
    // Scroll to show selected translation
    menu_scroll = 0;
    if (cur_trans >= visItems()) {
        int16_t mid   = (int16_t)cur_trans - (int16_t)(visItems() / 2);
        int16_t max_s = (int16_t)trans_count - (int16_t)visItems();
        menu_scroll   = (mid > max_s) ? max_s : mid;
        if (menu_scroll < 0) menu_scroll = 0;
    }
    scroll_px    = (float)menu_scroll * (float)itemH();
    needs_redraw = true;
}
void BibleInterface::goToSection() {
    stopFling();
    // Modes with a single section (e.g. Dictionary) skip the section list.
    if (numSecs() <= 1) { goToBook(0); return; }
    view = BV_SECTION_SELECT;
    // Scroll the current section into view (Songs can have many categories).
    menu_sel    = (int16_t)cur_sec;
    menu_scroll = 0;
    if (cur_sec >= visItems()) {
        int16_t mid   = (int16_t)cur_sec - (int16_t)(visItems() / 2);
        int16_t max_s = (int16_t)numSecs() - (int16_t)visItems();
        menu_scroll   = (mid > max_s) ? max_s : mid;
        if (menu_scroll < 0) menu_scroll = 0;
    }
    scroll_px   = (float)menu_scroll * (float)itemH();
    needs_redraw = true;
}
void BibleInterface::goToBook(uint8_t sec) {
    stopFling();
    cur_sec = sec;
    view    = BV_BOOK_SELECT;
    // Scroll to show cur_book within this section
    uint16_t local_idx = 0;
    if (sec == bookSection(cur_book)) {
        local_idx = cur_book - secStart(sec);
    }
    menu_sel    = (int16_t)local_idx;
    uint16_t cnt = secLen(sec);
    menu_scroll = 0;
    if (local_idx >= visItems()) {
        int16_t mid = (int16_t)local_idx - (int16_t)(visItems() / 2);
        int16_t max_s = (int16_t)cnt - (int16_t)visItems();
        menu_scroll = (mid > max_s) ? max_s : mid;
        if (menu_scroll < 0) menu_scroll = 0;
    }
    scroll_px = (float)menu_scroll * (float)itemH();
    needs_redraw = true;
}
void BibleInterface::goToChapter(uint16_t book) {
    stopFling();
    cur_book = book;
    // Single-chapter books (each Song is one chapter) skip the chapter grid and
    // open the reader directly.
    if (bookChapters(book) <= 1) { goToReading(1); return; }

    // Dictionary: show a scrollable list of pages ("firstword - lastword") instead
    // of the numeric grid — reads more like a dictionary.
    if (mode == MODE_DICT) {
        loadDictPages(book);
        view = BV_CHAPTER_SELECT;
        int16_t sel = (int16_t)cur_chapter - 1;       // page index (0-based)
        if (sel < 0 || sel >= (int16_t)rt_page_count) sel = 0;
        menu_sel    = sel;
        menu_scroll = 0;
        if (sel >= (int16_t)visItems()) {
            int16_t mid   = sel - (int16_t)(visItems() / 2);
            int16_t max_s = (int16_t)rt_page_count - (int16_t)visItems();
            menu_scroll   = (mid > max_s) ? max_s : mid;
            if (menu_scroll < 0) menu_scroll = 0;
        }
        scroll_px    = (float)menu_scroll * (float)itemH();
        needs_redraw = true;
        return;
    }

    view     = BV_CHAPTER_SELECT;
    // Scroll grid to show cur_chapter
    const uint16_t tile_h   = 36;
    uint8_t        vis_rows = (uint8_t)(contentH() / tile_h);
    int16_t        row      = (int16_t)((cur_chapter - 1) / 5);
    int16_t        total_rows = ((int16_t)bookChapters(book) + 4) / 5;
    int16_t        max_s    = total_rows - (int16_t)vis_rows;
    if (max_s < 0) max_s = 0;
    menu_scroll = row - (int16_t)(vis_rows / 2);
    if (menu_scroll > max_s)  menu_scroll = max_s;
    if (menu_scroll < 0)      menu_scroll = 0;
    menu_sel  = (int16_t)cur_chapter;   // 1-based; used for tile highlight
    scroll_px = (float)menu_scroll * (float)tile_h;
    needs_redraw = true;
}
// Boot/easter-egg splash: stream /splash.raw (RGB565, big-endian) from SD row-by-row.
// Drawn in the CURRENT orientation — the file must be sized to scrW()×scrH() for the
// active rotation (portrait file works for 0°/180°; make a landscape file for 90°/270°
// with make_splash.py --landscape). Returns false if absent or size mismatched.
bool BibleInterface::drawSplashImage() {
#ifdef MARAUDER_PANCAKE
    const int16_t MAXW = 480;
#else
    const int16_t MAXW = 320;
#endif
    // Try both splash files and use whichever one's embedded size matches the
    // current orientation — so a portrait splash.raw and a landscape
    // splash_land.raw can both live in the library folder and the right one is
    // auto-picked. 8-byte header: "SPL1" + uint16 width + uint16 height (LE).
    static const char* const PATHS[2] = { SD_LIB_ROOT "/splash.raw",
                                          SD_LIB_ROOT "/splash_land.raw" };
    for (uint8_t i = 0; i < 2; i++) {
        File f = SD.open(PATHS[i]);
        if (!f) continue;
        uint8_t hdr[8];
        if (f.read(hdr, 8) != 8 || memcmp(hdr, "SPL1", 4) != 0) { f.close(); continue; }
        int16_t fw = (int16_t)(hdr[4] | (hdr[5] << 8));
        int16_t fh = (int16_t)(hdr[6] | (hdr[7] << 8));
        if (fw != (int16_t)scrW() || fh != (int16_t)scrH() || fw > MAXW) { f.close(); continue; }
        tft.setSwapBytes(true);
        uint16_t row[MAXW];
        for (int16_t y = 0; y < fh; y++) {
            if (f.read((uint8_t*)row, fw * 2) != (int)(fw * 2)) break;
            tft.pushImage(0, y, fw, 1, row);
        }
        tft.setSwapBytes(false);
        f.close();
        return true;
    }
    return false;
}

