H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::showSplashUntilTap() {
    if (!drawSplashImage()) return;
    delay(350);                       // ignore the triggering tap's release
    for (;;) {
        uint16_t x, y;
        if (pollTouch(&x, &y)) break; // any tap dismisses
        delay(20);
    }
    needs_redraw = true;              // repaint the menu
}

void BibleInterface::drawLoading() {
    tft.fillScreen(bg());
    char hdr[48];
    snprintf(hdr, sizeof(hdr), "%s %d", bookDisplay(cur_book), cur_chapter);
    drawHeader(hdr);
    tft.setTextColor(dim_fg(), bg());
    tft.drawCentreString("Loading...", scrW() / 2, contentY() + contentH() / 2 - 8, 2);
    drawMemUsage((int16_t)(contentY() + contentH() / 2 + 16));
}

void BibleInterface::goToReading(uint16_t chapter, int16_t start_line) {
    stopFling();
    sel_verse_first = sel_verse_last = 0;  // clear verse selection on chapter change
    cur_chapter = chapter;
    // Dictionary: ensure the page labels for this letter are loaded (so the header
    // and page bookmarks can show "firstword - lastword"). Needed when arriving via
    // search/bookmark rather than the page list.
    if (mode == MODE_DICT && rt_pages_book != cur_book) loadDictPages(cur_book);
    read_line   = start_line;
    scroll_px   = (float)start_line * (float)lineH();
    drawLoading();
    view        = BV_READING;
    cacheChapter(cur_book, cur_chapter);
    buildWrappedLines();
    saveState();
    needs_redraw = true;
}
void BibleInterface::goToSettings(bool from_menu) {
    stopFling();
    settings_from_menu = from_menu;
    // Default scope = the context settings was opened from.
    settings_scope = from_menu ? 1 /*Main Menu*/ : (uint8_t)(mode + 2);
    buildSettingsRows();
    loadScopeSettings();   // load (and preview) the scope's look settings
    scopeScanTrans();      // populate the Translation row for the scope
    view = BV_SETTINGS;
    menu_sel = 0;
    menu_scroll = 0;
    scroll_px = 0.f;
    needs_redraw = true;
}
void BibleInterface::goToBookmarks() {
    stopFling();
    bm_confirm_pending = false;
    view = BV_BOOKMARKS;
    bm_sel = 0; bm_scroll = 0;
    scroll_px = 0.f;
    needs_redraw = true;
}
void BibleInterface::goToAbout() {
    stopFling();
    view = BV_ABOUT;
    needs_redraw = true;
}

// Firmware / hardware information screen. Identity strings come from configs.h
// (BIBLE_FW_* and per-board BOARD_*), so bumping the version is a one-line edit.
void BibleInterface::drawAbout() {
    tft.fillScreen(bg());
    drawHeader("About");

    int16_t cx = (int16_t)scrW() / 2;
    int16_t y  = (int16_t)contentY() + 10;

    // App name + version + author (centred, prominent).
    tft.setTextColor(fg(), bg());
    setUiFont(4);                             // larger smooth font for the app name
    tft.drawCentreString(BIBLE_FW_NAME, cx, y, 4);
    setUiFont(2);
    y += 34;
    char vbuf[40];
    snprintf(vbuf, sizeof(vbuf), "Version %s", BIBLE_FW_VERSION);
    tft.setTextColor(fg(), bg());
    tft.drawCentreString(vbuf, cx, y, 2);
    y += 22;
    tft.setTextColor(dim_fg(), bg());
    tft.drawCentreString("by " BIBLE_FW_AUTHOR, cx, y, 2);
    y += 26;

    tft.drawFastHLine(16, y, (int16_t)scrW() - 32, dim_fg());
    y += 10;

    // Label : value detail rows.
    auto row = [&](const char* label, const char* value) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawString(label, 14, y, 2);
        tft.setTextColor(fg(), bg());
        tft.drawString(value, 92, y, 2);
        y += 22;
    };
    row("Board",   BOARD_NAME);
    about_mcu_y0 = y;                 // remember the MCU row band for the splash easter egg
    row("MCU",     BOARD_MCU);
    about_mcu_y1 = y;
    row("Display", BOARD_DISPLAY);
    row("Touch",   BOARD_TOUCH);
#ifdef HAS_PSRAM
    row("PSRAM",   "Yes");
#else
    row("PSRAM",   "None");
#endif
    row("Built",   __DATE__);
    row("Commit",  BIBLE_FW_COMMIT);

    drawNavBar("Back", "", "");
}

void BibleInterface::handleAboutInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);
    if (down && !touch_was_down) {
        touch_was_down = true;
        touch_down_x = tx; touch_down_y = ty;
        return;
    }
    if (!down && touch_was_down) {
        touch_was_down = false;
        // Easter egg: tapping the MCU row shows the boot splash until tapped.
        if ((int16_t)touch_down_y >= about_mcu_y0 && (int16_t)touch_down_y < about_mcu_y1) {
            showSplashUntilTap();
            return;
        }
        // Header back arrow or the "Back" nav button returns to Settings.
        bool hdr_back = ((int16_t)touch_down_y < (int16_t)hdrH() && touch_down_x < 48);
        bool nav_back = (touchInNav(touch_down_x, touch_down_y) &&
                         touch_down_x < (int16_t)scrW() / 3);
        if (hdr_back || nav_back) { view = BV_SETTINGS; needs_redraw = true; }
    }
}
// ─────────────────────────────────────────────────────────────────────────────
// Mode-parameterized SD paths and NVS namespace
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::applyOrientation() {
    // 0 = Normal · 1 = Landscape · 2 = Flip 180 · 3 = Landscape flipped.
    // scrW()/scrH() track this so all layout adapts; setRotation maps 1:1.
    tft.setRotation(orientation & 3);
}

// Map a raw cap-touch point (native portrait frame) to the active orientation.
#ifndef HAS_CAP_TOUCH
// Resistive (XPT2046): read raw ADC, map to native portrait using the stored
// calibration (rotation 0), then rotate to the active orientation. This avoids
// TFT_eSPI's per-rotation getTouch() calibration, which breaks when the screen
// is rotated after a single (portrait) calibration.
bool BibleInterface::resistiveTouch(uint16_t* x, uint16_t* y) {
    if (tft.getTouchRawZ() < 600) return false;        // pressure threshold
    // The XPT2046 is noisy: a single raw read jitters by tens of pixels, which the
    // shared scroll logic misreads as a drag + fling — that made the settings list
    // flicker, scroll on its own, and swallow the Back tap. So take several samples
    // and average the middle ones (drop the min and max on each axis). Require a
    // few stable reads, otherwise treat it as no-touch (rejects pressure bounce and
    // phantom spikes that produced ghost taps).
    const uint8_t N = 7;
    uint16_t bx[N], by[N];
    uint8_t got = 0;
    for (uint8_t i = 0; i < N; i++) {
        if (tft.getTouchRawZ() < 600) break;
        uint16_t srx = 0, sry = 0;
        tft.getTouchRaw(&srx, &sry);
        bx[got] = srx; by[got] = sry; got++;
    }
    if (got < 4) return false;                          // not a stable press
    uint32_t sumx = 0, sumy = 0;
    uint16_t minx = 0xFFFF, maxx = 0, miny = 0xFFFF, maxy = 0;
    for (uint8_t i = 0; i < got; i++) {
        sumx += bx[i]; sumy += by[i];
        if (bx[i] < minx) minx = bx[i];
        if (bx[i] > maxx) maxx = bx[i];
        if (by[i] < miny) miny = by[i];
        if (by[i] > maxy) maxy = by[i];
    }
    sumx -= (uint32_t)minx + maxx;                      // drop the extremes
    sumy -= (uint32_t)miny + maxy;
    uint16_t rx = (uint16_t)(sumx / (got - 2));
    uint16_t ry = (uint16_t)(sumy / (got - 2));
    const int32_t NW = 240, NH = 320;                  // native portrait (ILI9341)
    int32_t x0 = cal_data[0], x1 = cal_data[1] ? cal_data[1] : 1;
    int32_t y0 = cal_data[2], y1 = cal_data[3] ? cal_data[3] : 1;
    int32_t px, py;
    if (!(cal_data[4] & 0x01)) { px = ((int32_t)rx - x0) * NW / x1; py = ((int32_t)ry - y0) * NH / y1; }
    else                       { px = ((int32_t)ry - x0) * NW / x1; py = ((int32_t)rx - y0) * NH / y1; }
    if (cal_data[4] & 0x02) px = NW - px;
    if (cal_data[4] & 0x04) py = NH - py;
    if (px < 0) px = 0; if (px >= NW) px = NW - 1;
    if (py < 0) py = 0; if (py >= NH) py = NH - 1;
    uint16_t fx = (uint16_t)px, fy = (uint16_t)py;
    orientTouch(fx, fy);                               // portrait → active orientation
    *x = fx; *y = fy;
    return true;
}
#endif

