H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::orientTouch(uint16_t& x, uint16_t& y) const {
#ifdef MARAUDER_PANCAKE
    const uint16_t NW = 320, NH = 480;
#else
    const uint16_t NW = 240, NH = 320;
#endif
    uint16_t rx = x, ry = y;
    switch (orientation & 3) {
        case 0: x = rx;                       y = ry;                       break;
        case 1: x = ry;                       y = (uint16_t)(NW - 1 - rx);  break;
        case 2: x = (uint16_t)(NW - 1 - rx);  y = (uint16_t)(NH - 1 - ry);  break;
        case 3: x = (uint16_t)(NH - 1 - ry);  y = rx;                       break;
    }
}

const char* BibleInterface::basePath() const {
    switch (mode) {
        case MODE_SONGS: return SONGS_SD_BASE;
        case MODE_DICT:  return DICT_SD_BASE;
        default:         return BIBLE_SD_BASE;
    }
}
const char* BibleInterface::nvsNamespace() const {
    switch (mode) {
        case MODE_SONGS: return "songs";
        case MODE_DICT:  return "dict";
        default:         return "bible";
    }
}
// (Re)open the member `prefs` handle on `ns` and remember which namespace it holds.
// All member-prefs opens go through here so persistU8() can avoid a colliding second
// RW open of the same namespace (which fails and silently dropped setting writes).
void BibleInterface::openNvs(const char* ns) {
    prefs.end();
    prefs.begin(ns, false);
    strncpy(prefs_ns, ns, sizeof(prefs_ns) - 1);
    prefs_ns[sizeof(prefs_ns) - 1] = 0;
}
// Persist one setting to `ns` without colliding with the member handle: if `prefs`
// already has that namespace open, write through it; otherwise use a fresh handle.
void BibleInterface::persistU8(const char* ns, const char* key, uint8_t val) {
    if (strcmp(prefs_ns, ns) == 0) {
        prefs.putUChar(key, val);
    } else {
        Preferences p;
        if (p.begin(ns, false)) { p.putUChar(key, val); p.end(); }
    }
}
// Read one setting from `ns` without a second handle on a namespace the member holds
// open — a second (even read-only) open of that namespace can fail, which made saved
// menu settings read back as defaults (i.e. "not persisting"). Mirrors persistU8.
uint8_t BibleInterface::readU8(const char* ns, const char* key, uint8_t def) {
    if (strcmp(prefs_ns, ns) == 0) return prefs.getUChar(key, def);
    Preferences p;
    if (p.begin(ns, true)) { uint8_t v = p.getUChar(key, def); p.end(); return v; }
    return def;
}
void BibleInterface::bmPath(char* out, size_t n) const {
    snprintf(out, n, "%s/bookmarks.txt", basePath());
}
void BibleInterface::srchHistPath(char* out, size_t n) const {
    snprintf(out, n, "%s/srch_hist.txt", basePath());
}

// ─────────────────────────────────────────────────────────────────────────────
// Runtime structure tables (Songs / Dictionary) — allocated from PSRAM if present
// ─────────────────────────────────────────────────────────────────────────────
// Allocate from PSRAM when available, but ALWAYS fall back to internal SRAM if
// PSRAM is absent or not enabled in the build — these tables are small (a few KB,
// up to ~50 KB for the largest songbook) and must never fail just because PSRAM
// isn't there. A NULL here used to crash Bible reads and bounce Songs/Dict to the menu.
static inline void* rt_alloc(size_t sz) {
#ifdef HAS_PSRAM
    void* p = ps_malloc(sz);
    if (p) return p;
#endif
    return malloc(sz);
}
#define RT_MALLOC(sz) rt_alloc(sz)

// Map the first character of a dictionary query to its letter-bucket book code
// (must match generate_dict_xml.py: a-z -> "A".."Z", digit -> "NUM", else "SYM";
// German umlauts fold to their base letter, matching the generator's bucketing).
static void dictBucketCode(char first, char* out) {
    unsigned char c = (unsigned char)first;
    char base = 0;
    if      (c >= 'A' && c <= 'Z') base = (char)(c - 'A' + 'a');
    else if (c >= 'a' && c <= 'z') base = (char)c;
    else if (c == 0x80 || c == 0x81) base = 'a';   // Ä ä
    else if (c == 0x82 || c == 0x83) base = 'o';   // Ö ö
    else if (c == 0x84 || c == 0x85) base = 'u';   // Ü ü
    else if (c == 0x86)              base = 's';    // ß
    if (base >= 'a' && base <= 'z') { out[0] = (char)(base - 'a' + 'A'); out[1] = 0; return; }
    if (c >= '0' && c <= '9') { strcpy(out, "NUM"); return; }
    strcpy(out, "SYM");
}

// Last loadToc() failure reason (shown on screen by selectTranslation).
static const char* g_toc_err = "";

void BibleInterface::freeRuntime() {
    if (rt_books)     { free(rt_books);     rt_books     = nullptr; }
    if (rt_secs)      { free(rt_secs);      rt_secs      = nullptr; }
    if (book_offsets) { free(book_offsets); book_offsets = nullptr; }
    if (rt_pages)     { free(rt_pages);     rt_pages     = nullptr; }
    rt_book_count = 0; rt_sec_count = 0; book_offsets_cap = 0;
    rt_page_count = 0; rt_pages_book = 0xFFFF;
}

// Dictionary: load the "firstword - lastword" labels for `book`'s pages from the
// generated <stem>.pgx. Falls back to "Page N" labels if the file is absent.
const char* BibleInterface::pageLabel(uint16_t i) const {
    if (rt_pages && i < rt_page_count) return rt_pages + (size_t)i * DICT_PAGE_LABEL_LEN;
    return "";
}

bool BibleInterface::loadDictPages(uint16_t book) {
    if (rt_pages) { free(rt_pages); rt_pages = nullptr; }
    rt_page_count = 0;
    rt_pages_book = 0xFFFF;
    if (book >= numBooks()) return false;
    uint16_t npages = bookChapters(book);
    if (npages == 0) npages = 1;

    rt_pages = (char*)RT_MALLOC((size_t)npages * DICT_PAGE_LABEL_LEN);
    if (!rt_pages) return false;
    rt_page_count = npages;
    rt_pages_book = book;
    for (uint16_t p = 0; p < npages; p++)              // default labels
        snprintf(rt_pages + (size_t)p * DICT_PAGE_LABEL_LEN, DICT_PAGE_LABEL_LEN,
                 "Page %d", p + 1);

    char path[80];
    snprintf(path, sizeof(path), "%s/%s.pgx", basePath(), trans_stems[cur_trans]);
    File f = SD.open(path);
    if (!f) return true;                              // fall back to "Page N"

    const char* code = bookCode(book);
    size_t clen = strlen(code);
    while (f.available()) {
        String line = f.readStringUntil('\n');
        line.trim();
        // Match "<code>|..." exactly (code is a single letter / NUM / SYM).
        if ((size_t)line.length() < clen + 1) continue;
        if (strncmp(line.c_str(), code, clen) != 0 || line[clen] != '|') continue;
        int p1 = clen;                                // the '|' after code
        int p2 = line.indexOf('|', p1 + 1);
        int p3 = (p2 >= 0) ? line.indexOf('|', p2 + 1) : -1;
        if (p2 < 0 || p3 < 0) continue;
        uint16_t pg = (uint16_t)line.substring(p1 + 1, p2).toInt();
        if (pg < 1 || pg > npages) continue;
        String first = line.substring(p2 + 1, p3);
        String last  = line.substring(p3 + 1);
        char* dst = rt_pages + (size_t)(pg - 1) * DICT_PAGE_LABEL_LEN;
        snprintf(dst, DICT_PAGE_LABEL_LEN, "%s - %s", first.c_str(), last.c_str());
        utf8Encode(dst);                              // render any umlauts
    }
    f.close();
    return true;
}

