H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// Load <base>/<stem>.toc into rt_books[], rt_secs[] and book_offsets[].
//   S|<section display name>
//   B|<code>|<display>|<chapterCount>|<sectionIndex>|<byteOffset>
// Books must be grouped by section and contiguous (the generator guarantees this).
// Restore a real '|' (the Fraktur "tz" ligature) that the generator escaped to
// 0x1F so it wouldn't be mistaken for a .toc field separator. Call on a display
// field after it has been split out, before utf8Encode.
static void tocRestorePipe(char* s) {
    for (; *s; s++) if ((uint8_t)*s == 0x1F) *s = '|';
}

bool BibleInterface::loadToc(const char* stem) {
    freeRuntime();
    g_read_fraktur = false;   // default; a "F|fraktur" line turns it on for this file
    char path[80];
    snprintf(path, sizeof(path), "%s/%s.toc", basePath(), stem);

    // Open ONCE and read the whole file into a buffer, then parse from memory.
    // (Avoids reopening the same SD file twice, which is unreliable on some builds.)
    g_toc_err = "";
    File f = SD.open(path);
    if (!f) { g_toc_err = "file not found"; Serial.printf("[%s] TOC missing: %s\n", nvsNamespace(), path); return false; }
    if (f.isDirectory()) { f.close(); g_toc_err = "is a directory"; return false; }
    size_t sz = f.size();
    if (sz == 0) { f.close(); g_toc_err = "file is empty"; Serial.printf("[%s] TOC empty: %s\n", nvsNamespace(), path); return false; }
    char* buf = (char*)RT_MALLOC(sz + 1);
    if (!buf) { f.close(); g_toc_err = "low memory (enable PSRAM)"; Serial.println(F("[toc] buf alloc fail")); return false; }
    size_t got = f.read((uint8_t*)buf, sz);
    f.close();
    buf[got] = 0;

    // Pass 1: count S| and B| lines.
    uint16_t nsec = 0, nbook = 0;
    for (char* ln = buf; *ln; ) {
        char* nl = strchr(ln, '\n');
        size_t len = nl ? (size_t)(nl - ln) : strlen(ln);
        if (len >= 2 && ln[1] == '|') {
            if      (ln[0] == 'S') nsec++;
            else if (ln[0] == 'B') nbook++;
        }
        if (!nl) break;
        ln = nl + 1;
    }
    if (nbook == 0) { free(buf); g_toc_err = "no B| rows (bad TOC)"; return false; }

    rt_secs      = (RtSec*)   RT_MALLOC(sizeof(RtSec)   * (nsec ? nsec : 1));
    rt_books     = (RtBook*)  RT_MALLOC(sizeof(RtBook)  * nbook);
    book_offsets = (uint32_t*)RT_MALLOC(sizeof(uint32_t)* nbook);
    if (!rt_secs || !rt_books || !book_offsets) { free(buf); freeRuntime(); g_toc_err = "low memory (enable PSRAM)"; return false; }
    book_offsets_cap = nbook;

    // Pass 2: fill (parse each line in place; field separator is '|').
    uint16_t si = 0, bi = 0;
    for (char* ln = buf; *ln; ) {
        char* nl = strchr(ln, '\n');
        if (nl) *nl = 0;                          // terminate this line
        // strip a trailing '\r' (in case the file has CRLF endings)
        size_t len = strlen(ln);
        while (len && (ln[len - 1] == '\r' || ln[len - 1] == ' ')) ln[--len] = 0;

        if (len >= 2 && ln[1] == '|') {
            if (ln[0] == 'F') {                 // F|fraktur → use the Fraktur reading font
                g_read_fraktur = (strcmp(ln + 2, "fraktur") == 0);
            } else if (ln[0] == 'S' && si < nsec) {
                strncpy(rt_secs[si].name, ln + 2, RT_SEC_NAME_LEN - 1);
                rt_secs[si].name[RT_SEC_NAME_LEN - 1] = 0;
                tocRestorePipe(rt_secs[si].name);
                utf8Encode(rt_secs[si].name);   // UTF-8 umlauts → private codes for rendering
                rt_secs[si].start = 0; rt_secs[si].len = 0;
                si++;
            } else if (ln[0] == 'B' && bi < nbook) {
                // B|<code>|<display>|<chapters>|<sectionIndex>|<byteOffset>
                char* f1 = strchr(ln + 2, '|');
                char* f2 = f1 ? strchr(f1 + 1, '|') : nullptr;
                char* f3 = f2 ? strchr(f2 + 1, '|') : nullptr;
                char* f4 = f3 ? strchr(f3 + 1, '|') : nullptr;
                if (f1 && f2 && f3 && f4) {
                    *f1 = *f2 = *f3 = *f4 = 0;       // split into fields
                    strncpy(rt_books[bi].code, ln + 2, RT_CODE_LEN - 1);
                    rt_books[bi].code[RT_CODE_LEN - 1] = 0;
                    strncpy(rt_books[bi].display, f1 + 1, RT_DISP_LEN - 1);
                    rt_books[bi].display[RT_DISP_LEN - 1] = 0;
                    tocRestorePipe(rt_books[bi].display);
                    utf8Encode(rt_books[bi].display);  // UTF-8 umlauts → private codes
                    uint16_t chaps = (uint16_t)atoi(f2 + 1);
                    rt_books[bi].chapters = chaps ? chaps : 1;
                    rt_books[bi].section  = (uint16_t)atoi(f3 + 1);
                    book_offsets[bi]      = (uint32_t)strtoul(f4 + 1, nullptr, 10);
                    bi++;
                }
            }
        }
        if (!nl) break;
        ln = nl + 1;
    }
    free(buf);
    rt_book_count = bi;
    rt_sec_count  = si;

    // Derive section start/len from the (contiguous, section-grouped) book list.
    for (uint16_t s = 0; s < rt_sec_count; s++) { rt_secs[s].start = 0; rt_secs[s].len = 0; }
    for (uint16_t b = 0; b < rt_book_count; b++) {
        uint16_t s = rt_books[b].section;
        if (s >= rt_sec_count) continue;
        if (rt_secs[s].len == 0) rt_secs[s].start = b;
        rt_secs[s].len++;
    }
    book_idx_valid = true;   // offsets came from the TOC; no .idx scan needed
    book_idx_trans = cur_trans;
    Serial.printf("[%s] TOC %s: %u sections, %u books\n",
                  nvsNamespace(), stem, rt_sec_count, rt_book_count);
    return true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Main menu (root) — pick Bible / Songs / Dictionary
// ─────────────────────────────────────────────────────────────────────────────
static const char* const MENU_LABELS[3] = { "Bible", "Songs", "Dictionary" };

void BibleInterface::goToMainMenu() {
    stopFling();
    // Restore the menu's own appearance/namespace (board-global brightness lives here).
    openNvs("menu");
    mode       = MODE_BIBLE;            // accessors unused at the menu
    theme_idx  = prefs.getUChar("theme", 0);
    if (theme_idx >= THEME_COUNT) theme_idx = 0;
    dark_mode  = THEMES[theme_idx].dark;
    accent_idx = prefs.getUChar("accent", 0);
    if (accent_idx >= ACCENT_COUNT) accent_idx = 0;
    accent_def = (prefs.getUChar("accentdef", 0) != 0);
    font_num   = 3;   // default reading size = Medium (VLW index)
    loadMenuChrome();
    font_color_idx = menu_font_color_idx;   // chrome/menu text follows the menu Font Color
    if (font_color_idx >= FONT_COLOR_COUNT) font_color_idx = 0;
    // Keep the current backlight level (avoids a brightness flash when returning
    // from a mode); each mode still applies its own brightness on entry.
    freeRuntime();
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;
    view = BV_MAIN_MENU;
    menu_sel = 0; menu_scroll = 0; scroll_px = 0.f;
    needs_redraw = true;
}

