H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::drawMainMenu() {
    tft.fillScreen(bg());
    drawHeader("ESP-32 Library", false);

    // All buttons use the menu theme's button background — the same colour the
    // Settings button and every header/nav button use — so the menu reads as one
    // consistent themed surface (driven by the theme set for the Main Menu scope).
    uint16_t btn_bg = hdr_bg();

    const int16_t margin = 16;
    const int16_t gap    = 14;
    const int16_t sh     = 34;                 // small Settings button height
    int16_t top   = (int16_t)contentY() + 12;
    int16_t avail = (int16_t)scrH() - top - 12;
    int16_t bh    = (avail - sh - gap * 3) / 3;
    setUiFont(4);                              // larger smooth font for the mode buttons
    int16_t lblH = (int16_t)VLW_FONTS[4].lineH;
    for (uint8_t i = 0; i < 3; i++) {
        int16_t y = top + i * (bh + gap);
        tft.fillRoundRect(margin, y, scrW() - 2 * margin, bh, 12, btn_bg);
        tft.drawRoundRect(margin, y, scrW() - 2 * margin, bh, 12, edgeColor(i * 3, dim_fg()));
        tft.setTextColor(chromeFg(), btn_bg);
        tft.drawCentreString(MENU_LABELS[i], scrW() / 2, y + (bh - lblH) / 2, 4);
    }
    setUiFont(2);                              // restore the normal UI size
    // Smaller Settings button under Dictionary.
    int16_t sy = top + 3 * (bh + gap);
    int16_t sw = (int16_t)((scrW() - 2 * margin) * 7 / 10);
    int16_t sx = ((int16_t)scrW() - sw) / 2;
    int16_t uiH = (int16_t)VLW_FONTS[2].lineH;
    tft.fillRoundRect(sx, sy, sw, sh, 10, hdr_bg());
    tft.drawRoundRect(sx, sy, sw, sh, 10, edgeColor(9, dim_fg()));
    tft.setTextColor(chromeFg(), hdr_bg());
    tft.drawCentreString("Settings", scrW() / 2, sy + (sh - uiH) / 2, 2);
}

void BibleInterface::handleMainMenuInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);
    if (down && !touch_was_down) {
        touch_was_down = true;
        touch_down_x = tx; touch_down_y = ty;
        return;
    }
    if (!down && touch_was_down) {
        touch_was_down = false;
        // Easter egg: tap the header to show the boot splash again until tapped.
        if ((int16_t)touch_down_y < (int16_t)hdrH()) { showSplashUntilTap(); return; }
        const int16_t margin = 16;
        const int16_t gap    = 14;
        const int16_t sh     = 34;
        int16_t top   = (int16_t)contentY() + 12;
        int16_t avail = (int16_t)scrH() - top - 12;
        int16_t bh    = (avail - sh - gap * 3) / 3;
        for (uint8_t i = 0; i < 3; i++) {
            int16_t y = top + i * (bh + gap);
            if ((int16_t)touch_down_y >= y && (int16_t)touch_down_y < y + bh &&
                (int16_t)touch_down_x >= margin && (int16_t)touch_down_x < (int16_t)scrW() - margin) {
                enterMode((ContentMode)i);
                return;
            }
        }
        // Settings button (smaller, under Dictionary).
        int16_t sy = top + 3 * (bh + gap);
        int16_t sw = (int16_t)((scrW() - 2 * margin) * 7 / 10);
        int16_t sx = ((int16_t)scrW() - sw) / 2;
        if ((int16_t)touch_down_y >= sy && (int16_t)touch_down_y < sy + sh &&
            (int16_t)touch_down_x >= sx && (int16_t)touch_down_x < sx + sw) {
            goToSettings(true);   // from main menu
            return;
        }
        // Tap on empty menu background: do nothing (no flash / repaint).
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Mode switching
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::enterMode(ContentMode m) {
    mode = m;
    freeRuntime();
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;

    openNvs(nvsNamespace());
    loadState();                          // per-mode font/dark/accent/position/search
    // Brightness is global (set once at boot in blInit) — no per-mode re-apply.
    loadBookmarks();
    loadSearchHistory();
    scanTranslations();

    if (trans_count == 0) {
        tft.fillScreen(bg());
        drawHeader("ESP-32 Library", false);
        tft.setTextColor(TFT_RED, bg());
        char msg[48];
        snprintf(msg, sizeof(msg), "No %s files on SD", MENU_LABELS[m]);
        tft.drawCentreString(msg, scrW() / 2, scrH() / 2 - 18, 2);
        char where[48];
        snprintf(where, sizeof(where), "Copy .xml to %s/", basePath());
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString(where, scrW() / 2, scrH() / 2 + 6, 2);
        tft.drawCentreString("Tap to go back", scrW() / 2, scrH() / 2 + 30, 2);
        // Block until a full tap (press + release), then redraw the main menu.
        uint16_t tx, ty;
        while (pollTouch(&tx, &ty)) { delay(10); yield(); }   // clear any held touch
        while (!pollTouch(&tx, &ty)) { delay(10); yield(); }  // wait for a press
        while (pollTouch(&tx, &ty)) { delay(10); yield(); }   // wait for release
        touch_was_down = false;
        goToMainMenu();   // reloads menu chrome, sets view + needs_redraw
        return;
    }
    if (cur_trans >= trans_count) cur_trans = 0;

    // Multiple translations → show the picker; otherwise open the single one.
    if (trans_count > 1) {
        if (mode != MODE_BIBLE) loadToc(trans_stems[cur_trans]);  // so cur_book clamps correctly
        goToTransSelect();
    } else {
        selectTranslation(cur_trans);
    }
}

void BibleInterface::selectTranslation(uint16_t idx) {
    if (idx >= trans_count) idx = 0;
    cur_trans = (uint8_t)idx;
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;

    if (mode != MODE_BIBLE) {
        if (!loadToc(trans_stems[cur_trans])) {
            // Structure file missing/unreadable — tell the user which file, then
            // wait for a tap (rather than silently bouncing to the menu).
            tft.fillScreen(bg());
            drawHeader("ESP-32 Library", false);
            tft.setTextColor(TFT_RED, bg());
            char msg[72];
            snprintf(msg, sizeof(msg), "%s/%s.toc", basePath(), trans_stems[cur_trans]);
            tft.drawCentreString(msg, scrW() / 2, scrH() / 2 - 24, 2);
            tft.setTextColor(dim_fg(), bg());
            char reason[64];
            snprintf(reason, sizeof(reason), "TOC error: %s", g_toc_err[0] ? g_toc_err : "unknown");
            tft.drawCentreString(reason, scrW() / 2, scrH() / 2 - 2, 2);
            tft.drawCentreString("Copy the .toc next to the .xml", scrW() / 2, scrH() / 2 + 20, 2);
            tft.drawCentreString("Tap to go back", scrW() / 2, scrH() / 2 + 42, 2);
            mode = MODE_BIBLE;
            view = BV_MAIN_MENU;
            needs_redraw = false;
            return;
        }
        if (cur_book >= numBooks()) cur_book = 0;
        cur_sec = (numBooks() > 0) ? bookSection(cur_book) : 0;
        if (cur_chapter == 0 || cur_chapter > bookChapters(cur_book)) cur_chapter = 1;
    } else {
        // Bible: ensure the byte-offset buffer exists (filled lazily from the .idx
        // file inside cacheChapter). loadToc() handles this for Songs/Dict.
        g_read_fraktur = false;   // Bible always uses the normal reading font
        if (!book_offsets || book_offsets_cap < BIBLE_BOOK_COUNT) {
            if (book_offsets) free(book_offsets);
            book_offsets     = (uint32_t*)RT_MALLOC(sizeof(uint32_t) * BIBLE_BOOK_COUNT);
            book_offsets_cap = book_offsets ? BIBLE_BOOK_COUNT : 0;
        }
        if (book_offsets) memset(book_offsets, 0, sizeof(uint32_t) * BIBLE_BOOK_COUNT);
        if (cur_book >= numBooks()) cur_book = 0;
        cur_sec = bookSection(cur_book);
    }
    saveState();
    goToSection();
}

void BibleInterface::goBack() {
    stopFling();
    switch (view) {
        case BV_MAIN_MENU:       /* already root */ break;
        case BV_TRANS_SELECT:    goToMainMenu(); break;
        case BV_SECTION_SELECT:
            if (trans_count > 1) goToTransSelect();
            else                 goToMainMenu();
            break;
        case BV_BOOK_SELECT:
            if      (numSecs() > 1)    goToSection();
            else if (trans_count > 1)  goToTransSelect();
            else                       goToMainMenu();
            break;
        case BV_CHAPTER_SELECT:  goToBook(bookSection(cur_book)); break;
        case BV_READING:
            if (reading_from_search) {
                reading_from_search = false;
                highlight_verse     = 0;
                view      = BV_SEARCH_RESULTS;
                scroll_px = (float)menu_scroll * (float)srchH();
                needs_redraw = true;
            } else if (bookChapters(cur_book) <= 1) {
                // Single-chapter book (Song): chapter grid is skipped, so go to
                // the book (song) list rather than back into the reader.
                goToBook(bookSection(cur_book));
            } else {
                goToChapter(cur_book);
            }
            break;
        case BV_SETTINGS:
            // Restore the active context's look (settings may have previewed another scope).
            settings_scope = settings_from_menu ? 1 : (uint8_t)(mode + 2);
            loadScopeSettings();
            if (settings_from_menu) { goToMainMenu(); break; }
            if (cached_count > 0) {
                buildWrappedLines();   // re-wrap in case Font Size changed
                view = BV_READING;
                scroll_px = (float)read_line * (float)lineH();
                needs_redraw = true;
            } else {
                goToSection();
            }
            break;
        case BV_BOOKMARKS:
            bm_confirm_pending = false;
            if (cached_count > 0) {
                view = BV_READING;
                scroll_px = (float)read_line * (float)lineH();
                needs_redraw = true;
            } else {
                goToSection();
            }
            break;
        case BV_SEARCH_RESULTS:
            goToSearchInput();
            break;
        case BV_SEARCH_INPUT:
            search_del_pending = false;
            if (cached_count > 0) {
                view = BV_READING;
                scroll_px = (float)read_line * (float)lineH();
                needs_redraw = true;
            } else {
                goToSection();
            }
            break;
    }
}
void BibleInterface::addBookmarkCurrent() {
    BibleBookmark bm;
    bm.book        = cur_book;
    bm.chapter     = cur_chapter;
    bm.verse_first = sel_verse_first;
    bm.verse_last  = sel_verse_last;
    bm.trans       = cur_trans;   // legacy fallback
    // Stable identifiers (Songs/Dict): the songbook stem + the song's osisID code,
    // so the bookmark still resolves after the songbook set/order changes.
    if (mode == MODE_BIBLE) {
        bm.stem[0] = 0;
        bm.code[0] = 0;
    } else {
        strncpy(bm.stem, trans_stems[cur_trans], BIBLE_TRANS_LEN - 1);
        bm.stem[BIBLE_TRANS_LEN - 1] = 0;
        strncpy(bm.code, bookCode(cur_book), RT_CODE_LEN - 1);
        bm.code[RT_CODE_LEN - 1] = 0;
    }

