H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    scroll_px += fling_vel * dt;
    if (scroll_px < 0.f)     scroll_px = 0.f;
    if (scroll_px > max_px)  scroll_px = max_px;

    // Exponential decay — velocity halves every ~350ms
    fling_vel *= expf(-2.0f * dt);

    if (fabsf(fling_vel) < 30.f || scroll_px <= 0.f || scroll_px >= max_px)
        fling_active = false;

    // Sync integer scroll vars and do a partial redraw
    switch (view) {
        case BV_TRANS_SELECT:
        case BV_SECTION_SELECT:
        case BV_BOOK_SELECT:
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            redrawListContent(
                view == BV_TRANS_SELECT   ? trans_count :
                view == BV_SECTION_SELECT ? numSecs() :
                                            secLen(cur_sec));
            break;
        case BV_CHAPTER_SELECT:
            menu_scroll = (int16_t)(scroll_px / 36.f);
            redrawChapterContent();
            break;
        case BV_READING:
            // read_line is updated inside drawReadingLines via scroll_px
            drawReadingLines();
            break;
        case BV_BOOKMARKS:
            bm_scroll = (int16_t)(scroll_px / (float)itemH());
            redrawListContent(bm_count);
            break;
        case BV_SEARCH_INPUT:
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            redrawListContent(search_hist_count);
            break;
        case BV_SEARCH_RESULTS:
            menu_scroll = (int16_t)(scroll_px / (float)srchH());
            redrawSearchResultsContent();
            break;
        case BV_SETTINGS:
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            redrawSettingsContent();
            break;
        default: break;
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// XML streaming parser — caches all verses for one chapter
// ─────────────────────────────────────────────────────────────────────────────

// Read one byte from the XML file (buffered in 512-byte chunks)
bool BibleInterface::xmlNextByte(XmlState& s, char& c) {
    if (s.chunk_pos >= s.chunk_len) {
        s.chunk_len = s.f.read(s.chunk, XML_CHUNK_SIZE);
        s.chunk_pos = 0;
        if (s.chunk_len <= 0) return false;
    }
    c = (char)s.chunk[s.chunk_pos++];
    return true;
}

// Decode common XML entities in-place
void BibleInterface::xmlDecodeEntities(char* buf, size_t len) {
    struct { const char* ent; char ch; } map[] = {
        { "&amp;", '&' }, { "&lt;", '<' }, { "&gt;", '>' },
        { "&apos;", '\'' }, { "&quot;", '"' }, { "&nbsp;", ' ' },
        { nullptr, 0 }
    };
    for (size_t i = 0; i < len && buf[i]; i++) {
        if (buf[i] != '&') continue;
        for (int m = 0; map[m].ent; m++) {
            size_t elen = strlen(map[m].ent);
            if (strncmp(buf + i, map[m].ent, elen) == 0) {
                buf[i] = map[m].ch;
                memmove(buf + i + 1, buf + i + elen, len - i - elen);
                break;
            }
        }
    }
}

// Compress multi-byte UTF-8 to private single-byte codes the VLW fonts render:
//   umlauts/ß  0x80=Ä 0x81=ä 0x82=Ö 0x83=ö 0x84=Ü 0x85=ü 0x86=ß
//   typographic 0x87=„ 0x88=" 0x89=‚ 0x8A=' 0x8B=' 0x8C=– 0x8D=— 0x8E=…
// Other unrecognised multi-byte sequences: lead byte kept, trail dropped.
// Uses read/write pointers so no additional buffer is needed.
void BibleInterface::utf8Encode(char* buf) {
    char* r = buf;
    char* w = buf;
    while (*r) {
        uint8_t b  = (uint8_t)*r;
        uint8_t b1 = (b >= 0x80) ? (uint8_t)r[1] : 0;   // 0 if string ends early
        uint8_t b2 = (b >= 0xE0 && b1) ? (uint8_t)r[2] : 0;

        if (b < 0x80) { *w++ = *r++; continue; }         // plain ASCII

        // ── 2-byte: Latin-1 supplement (0xC2/0xC3) ────────────────────────────
        if (b == 0xC3 && b1) {
            switch (b1) {
                case 0x84: *w++ = (char)0x80; break;     // Ä
                case 0xA4: *w++ = (char)0x81; break;     // ä
                case 0x96: *w++ = (char)0x82; break;     // Ö
                case 0xB6: *w++ = (char)0x83; break;     // ö
                case 0x9C: *w++ = (char)0x84; break;     // Ü
                case 0xBC: *w++ = (char)0x85; break;     // ü
                case 0x9F: *w++ = (char)0x86; break;     // ß
                default:   /* other accented Latin — drop */ break;
            }
            r += 2; continue;
        }
        if (b == 0xC2 && b1) {
            // Kept as their raw Latin-1 byte (rendered via the font's U+00xx glyph);
            // in the Fraktur font ¡/¿ are the ch/ck ligatures.
            if      (b1 == 0xA0) *w++ = ' ';             // non-breaking space
            else if (b1 == 0xA1) *w++ = (char)0xA1;      // ¡  (Fraktur: ch ligature)
            else if (b1 == 0xBF) *w++ = (char)0xBF;      // ¿  (Fraktur: ck ligature)
            else if (b1 == 0xB4) *w++ = (char)0xB4;      // ´  acute accent
            /* else (©, °, …) drop */
            r += 2; continue;
        }

        // ── 3-byte: typographic marks (0xE2 …) → private codes 0x87-0x8E so they
        //    render literally in the font (variants fold onto the baked glyphs). ──
        if (b == 0xE2 && b1 && b2) {
            if (b1 == 0x80) {
                switch (b2) {
                    case 0x9E:            *w++ = (char)0x87; break;  // „ low double
                    case 0x9C: case 0x9D: case 0x9F:
                                          *w++ = (char)0x88; break;  // “ ” ‟ → " high double
                    case 0x9A:            *w++ = (char)0x89; break;  // ‚ low single
                    case 0x98:            *w++ = (char)0x8A; break;  // ‘ left single
                    case 0x99: case 0x9B: *w++ = (char)0x8B; break;  // ’ ‛ → ' right single
                    case 0x90: case 0x91: case 0x93:
                                          *w++ = (char)0x8C; break;  // ‐ ‑ – → en dash
                    case 0x94: case 0x95: *w++ = (char)0x8D; break;  // — ― → em dash
                    case 0xA6:            *w++ = (char)0x8E; break;  // … ellipsis
                    case 0xB0:            *w++ = (char)0x8F; break;  // ‰ per mille
                    case 0xA2: *w++ = '*';  break;                   // • bullet (no glyph)
                    case 0xAF: *w++ = ' ';  break;                   // narrow nbsp
                    default: break;                                  // zwsp etc. drop
                }
            } else if (b1 == 0x88 && b2 == 0x92) {
                *w++ = '-';                                          // − minus sign
            }
            r += 3; continue;
        }

        // ── Any other multibyte sequence: drop it whole (never leak a byte) ────
        if (b >= 0xF0)      r += (r[1] && r[2] && r[3]) ? 4 : 1;  // 4-byte
        else if (b >= 0xE0) r += (b1 && b2) ? 3 : 1;             // 3-byte
        else if (b >= 0xC0) r += b1 ? 2 : 1;                     // 2-byte
        else                r += 1;                              // stray continuation
    }
    *w = 0;
}

// Measure pixel width of a private-code string in the loaded UI VLW font.
int16_t BibleInterface::textWidthUTF8(const char* str, uint8_t /*font*/) {
    return vlwTextWidth(g_ui_vlw, str);
}

// Extract attribute value from a tag string like:  verse osisID="Gen.1.1"
bool BibleInterface::xmlGetAttr(const char* tag, const char* attr, char* out, size_t out_len) {
    const char* p = strstr(tag, attr);
    if (!p) return false;
    p += strlen(attr);
    while (*p == ' ') p++;
    if (*p != '=') return false;
    p++;
    while (*p == ' ') p++;
    char delim = (*p == '"' || *p == '\'') ? *p++ : ' ';
    size_t n = 0;
    while (*p && *p != delim && n < out_len - 1)
        out[n++] = *p++;
    out[n] = 0;
    return (n > 0);
}

bool BibleInterface::cacheChapter(uint16_t book, uint16_t chapter) {
    if (cached_book == book && cached_chap == chapter) return (cached_count > 0);
    cached_count = 0;
    cached_book  = book;
    cached_chap  = chapter;

    if (trans_count == 0 || book >= numBooks()) return false;

    // ── Book byte-offset index ─────────────────────────────────────────────
    // Bible: load (or build+save) the .idx so we can seek directly to a book.
    // Songs/Dict: book_offsets[] is already filled by loadToc() (no .idx scan).
    if (mode == MODE_BIBLE) {
        // Defensive: guarantee the offset buffer exists and is large enough before
        // any index load/build/seek. A prior Songs/Dict session can free or resize
        // it, and the original alloc in selectTranslation can fail under memory
        // pressure — either left book_offsets NULL/undersized, and loadBookIndex/
        // buildBookIndex/seek then wrote through it and crashed intermittently.
        if (!book_offsets || book_offsets_cap < BIBLE_BOOK_COUNT) {
            if (book_offsets) free(book_offsets);
            book_offsets     = (uint32_t*)RT_MALLOC(sizeof(uint32_t) * BIBLE_BOOK_COUNT);
            book_offsets_cap = book_offsets ? BIBLE_BOOK_COUNT : 0;
            if (book_offsets) memset(book_offsets, 0, sizeof(uint32_t) * BIBLE_BOOK_COUNT);
            book_idx_valid = false;   // must (re)load into the fresh buffer
        }
        if (!book_offsets) return false;   // out of memory — fail, don't crash

        if (!book_idx_valid || book_idx_trans != cur_trans) {
            if (!loadBookIndex(trans_stems[cur_trans])) {
                buildBookIndex(trans_stems[cur_trans]);
                saveBookIndex(trans_stems[cur_trans]);
            }
            book_idx_valid = true;
            book_idx_trans = cur_trans;
        }
    }

    // Build file path: /bible/<stem>.xml
    char path[64];
    snprintf(path, sizeof(path), "%s/%s.xml", basePath(), trans_stems[cur_trans]);

    File f = SD.open(path);
    if (!f) {
        Serial.print(F("[Bible] Cannot open ")); Serial.println(path);
        return false;
    }

    // Seek to the book's starting byte — skips all preceding books.
    // (Bounds-checked: a missing/short index just means scan from offset 0.)
    if (book_offsets && book < book_offsets_cap && book_offsets[book] > 0)
        f.seek(book_offsets[book]);

    // Build the osisID prefix we are looking for: "Book.Chapter."
    // e.g. "Gen.1." for Genesis chapter 1
    char prefix[32];
    snprintf(prefix, sizeof(prefix), "%s.%d.", bookCode(book), chapter);
    size_t prefix_len = strlen(prefix);

    // Build the osisID prefix for the NEXT chapter so we know when to stop
    char next_prefix[32];
    snprintf(next_prefix, sizeof(next_prefix), "%s.%d.", bookCode(book), chapter + 1);

