H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::addWrappedLine(uint8_t verse_num, const char* text,
                                     uint16_t max_px, uint8_t fnt, uint16_t& idx) {
    const char* p            = text;
    bool        is_first_line = true;   // true only for the verse's first screen line
    const uint8_t* vfont     = vlwForSize(fnt);   // reading uses the smooth VLW font

    // For the verse-first line the verse number prefix is drawn to the left of the
    // content text, so the available content width is narrowed by its pixel width.
    uint16_t first_max_px = max_px;
    if (verse_num > 0) {
        char num_str[12];
        snprintf(num_str, sizeof(num_str), "%d.", verse_num);
        int16_t num_w = vlwTextWidth(vfont, num_str) + 2;  // +2px gap
        first_max_px  = (num_w < (int16_t)max_px) ? (uint16_t)(max_px - num_w) : 0;
    }

    while (*p && idx < BIBLE_MAX_LINES) {
        char* out     = lines[idx];
        int   out_len = 0;

        uint16_t line_max = is_first_line ? first_max_px : max_px;

        if (is_first_line) {
            // Prefix: "^N|" where N is the verse number
            out_len = snprintf(out, BIBLE_LINE_BUF, "^%d|", verse_num);
        } else {
            out[0] = 0;
        }
        is_first_line = false;

        // Fill the line word by word.  A '\n' in the text forces a line break
        // (used by Songs so stanza line structure is preserved).
        bool forced_nl = false;
        char tmp[BIBLE_LINE_BUF];
        while (*p) {
            // Advance to end of next word (stop at space or newline)
            const char* wp = p;
            while (*wp && *wp != ' ' && *wp != '\n') wp++;
            // Include trailing space if present (newline is not stored)
            int wlen = (int)(wp - p) + (*wp == ' ' ? 1 : 0);

            // Test fit
            int tmp_len = out_len + wlen;
            if (tmp_len >= BIBLE_LINE_BUF) break; // line buffer full

            memcpy(tmp, out, out_len);
            memcpy(tmp + out_len, p, wlen);
            tmp[tmp_len] = 0;

            // Strip the "^N|" prefix for pixel-width measurement
            const char* measure = tmp;
            if (measure[0] == '^') {
                measure = strchr(measure, '|');
                if (measure) measure++; else measure = tmp;
            }

            int16_t px = vlwTextWidth(vfont, measure);
            if (px > (int16_t)line_max && out_len > 0) break; // word doesn't fit

            memcpy(out, tmp, tmp_len + 1);
            out_len = tmp_len;
            p = wp;
            if (*p == ' ') { p++; }
            else if (*p == '\n') { p++; forced_nl = true; break; }  // explicit break
        }

        // Nothing fit on this line (single word wider than line_max).
        // Detect: continuation line with nothing added (out_len==0), OR verse-first
        // line with only the "^N|" prefix and no content added.
        // Skipped after a forced newline break (an intentionally short/blank line).
        int prefix_len = (out[0] == '^') ? (int)(strchr(out, '|') - out + 1) : 0;
        if (!forced_nl && out_len <= prefix_len) {
            // Force-add characters until the pixel budget is exhausted.
            // Preserve any existing prefix in out[0..prefix_len-1].
            char tmp2[BIBLE_LINE_BUF];
            memcpy(tmp2, out, prefix_len);  // copy prefix (or nothing)
            int n = prefix_len;
            while (*p && n < BIBLE_LINE_BUF - 1) {
                tmp2[n++] = *p++;
                tmp2[n]   = 0;
                // Measure only the content part (after prefix)
                const char* measure2 = tmp2 + prefix_len;
                if (vlwTextWidth(vfont, measure2) > (int16_t)line_max) {
                    // Back off the last character
                    if (n > prefix_len) { n--; tmp2[n] = 0; p--; }
                    break;
                }
            }
            memcpy(out, tmp2, n + 1);
            out_len = n;
            if (out_len <= prefix_len) { p++; }  // unprintably wide single char — skip
        }

        idx++;
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Persistence
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::saveState() {
    prefs.putUShort("book",     cur_book);
    prefs.putUShort("chap",     cur_chapter);
    prefs.putUChar("trans",     cur_trans);
    prefs.putUChar("font",      font_num);
    prefs.putUChar("fontcol",   font_color_idx);
    prefs.putUChar("vnumcol",   vnum_color_idx);
    prefs.putUChar("theme",     theme_idx);
    prefs.putUChar("accentdef", accent_def ? 1 : 0);
    prefs.putBool ("dark",      dark_mode);   // kept for backward compatibility
    prefs.putUChar("accent",    accent_idx);
    prefs.putBool ("srch_part", srch_partial_match);
    prefs.putBool ("srch_pnct", srch_ignore_punct);
    prefs.putUChar("srch_scp",  srch_scope);
}

void BibleInterface::loadState() {
    cur_book          = prefs.getUShort("book",     0);
    cur_chapter       = prefs.getUShort("chap",     1);
    cur_trans         = prefs.getUChar("trans",     0);
    font_num          = prefs.getUChar("font",      3);
    font_color_idx    = prefs.getUChar("fontcol",   0);
    if (font_color_idx >= FONT_COLOR_COUNT) font_color_idx = 0;
    vnum_color_idx    = prefs.getUChar("vnumcol",   0);
    if (vnum_color_idx >= FONT_COLOR_COUNT) vnum_color_idx = 0;
    // Theme: prefer "theme" index; fall back to the legacy "dark" bool (0=Dark,1=Light).
    theme_idx         = prefs.getUChar("theme", 0xFF);
    if (theme_idx == 0xFF) theme_idx = prefs.getBool("dark", true) ? 0 : 1;
    if (theme_idx >= THEME_COUNT) theme_idx = 0;
    dark_mode         = THEMES[theme_idx].dark;
    accent_idx        = prefs.getUChar("accent",    0);
    accent_def        = (prefs.getUChar("accentdef", 0) != 0);
    srch_partial_match = prefs.getBool ("srch_part", true);
    srch_ignore_punct  = prefs.getBool ("srch_pnct", true);
    srch_scope         = prefs.getUChar("srch_scp",  0);
    if (mode == MODE_BIBLE && cur_book >= BIBLE_BOOK_COUNT) cur_book = 0;
    if (cur_chapter == 0)               cur_chapter = 1;
    if (cur_trans  >= BIBLE_MAX_TRANS)  cur_trans  = 0;
    if (font_num >= VLW_FONT_COUNT) font_num = 3;   // VLW reading-size index; 3 = Medium
    if (accent_idx >= ACCENT_COUNT)     accent_idx = 0;
    if (srch_scope >= 3)                srch_scope  = 0;
    // Derive section from book so navigation back shows correct highlight.
    // For Songs/Dict the runtime table is not loaded yet here — selectTranslation()
    // recomputes cur_sec after loadToc().
    cur_sec = (mode == MODE_BIBLE) ? bookSection(cur_book) : 0;
}

void BibleInterface::saveBookmarks() {
    char path[64];
    bmPath(path, sizeof(path));
    File f = SD.open(path, FILE_WRITE);
    if (!f) return;
    // Bible:        "book chapter verse_first verse_last label"   (canon-global book)
    // Songs/Dict:   "T<stem>|<code> book chapter verse_first verse_last label"
    //   The leading "T" token holds the stable songbook stem + song code. (Older
    //   "T<number>" index files still load — see loadBookmarks — but are fragile.)
    for (uint8_t i = 0; i < bm_count; i++) {
        if (mode == MODE_BIBLE) {
            f.printf("%d %d %d %d %s\n",
                     bookmarks[i].book, bookmarks[i].chapter,
                     bookmarks[i].verse_first, bookmarks[i].verse_last,
                     bookmarks[i].label);
        } else {
            f.printf("T%s|%s %d %d %d %d %s\n",
                     bookmarks[i].stem, bookmarks[i].code,
                     bookmarks[i].book, bookmarks[i].chapter,
                     bookmarks[i].verse_first, bookmarks[i].verse_last,
                     bookmarks[i].label);
        }
    }
    f.close();
}

void BibleInterface::loadBookmarks() {
    bm_count = 0;
    char path[64];
    bmPath(path, sizeof(path));
    File f = SD.open(path);
    if (!f) return;
    while (f.available() && bm_count < BIBLE_MAX_BM) {
        String line = f.readStringUntil('\n');
        line.trim();
        if (line.length() == 0) continue;

        // Songs/Dict lines start with a "T..." token holding either the stable
        // "<stem>|<code>" (new) or a bare "<trans>" index (legacy). Strip and remember.
        uint8_t bm_trans = 0;
        char    bm_stem[BIBLE_TRANS_LEN] = {0};
        char    bm_code[RT_CODE_LEN]     = {0};
        if (line[0] == 'T' && line.length() > 1 && line[1] != ' ') {
            int sp = line.indexOf(' ');
            if (sp < 0) continue;
            String tok = line.substring(1, sp);   // "<stem>|<code>" or "<trans>"
            int bar = tok.indexOf('|');
            if (bar >= 0) {                        // new stable format
                strncpy(bm_stem, tok.substring(0, bar).c_str(), BIBLE_TRANS_LEN - 1);
                strncpy(bm_code, tok.substring(bar + 1).c_str(), RT_CODE_LEN - 1);
                for (uint8_t t = 0; t < trans_count; t++)   // resolve trans for the fallback
                    if (strcmp(trans_stems[t], bm_stem) == 0) { bm_trans = t; break; }
            } else {                               // legacy index format
                bm_trans = (uint8_t)tok.toInt();
            }
            line = line.substring(sp + 1);
            line.trim();
        }

        int s1 = line.indexOf(' ');
        int s2 = (s1 >= 0) ? line.indexOf(' ', s1 + 1) : -1;
        if (s1 < 0 || s2 < 0) continue;
        uint16_t book = (uint16_t)line.substring(0, s1).toInt();
        uint16_t chap = (uint16_t)line.substring(s1 + 1, s2).toInt();
        if (chap == 0) continue;

        // Detect format: new has two more integer tokens before the label.
        // Check tokens 3 and 4 — if both are all-digit, it is new format.
        // This handles book names starting with a digit (1Ki, 2Co, 1John, etc.)
        // because those names contain letters and will fail the all-digit check.
        int s3 = line.indexOf(' ', s2 + 1);
        int s4 = (s3 >= 0) ? line.indexOf(' ', s3 + 1) : -1;
        bool new_fmt = false;
        if (s3 > s2 + 1 && s4 > s3 + 1) {
            new_fmt = true;
            for (int k = s2 + 1; k < s3 && new_fmt; k++)
                if (!isdigit((unsigned char)line[k])) new_fmt = false;
            for (int k = s3 + 1; k < s4 && new_fmt; k++)
                if (!isdigit((unsigned char)line[k])) new_fmt = false;
        }

