H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::drawSearchDelConfirm() {
    int16_t pop_w = (int16_t)scrW() - 40;
    int16_t pop_h = 80;
    int16_t pop_x = 20;
    int16_t pop_y = (int16_t)(scrH() / 2) - 40;

    tft.fillRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, bg());
    tft.drawRoundRect(pop_x,     pop_y,     pop_w,     pop_h,     6, dim_fg());
    tft.drawRoundRect(pop_x + 1, pop_y + 1, pop_w - 2, pop_h - 2, 6, dim_fg());

    tft.setTextColor(fg(), bg());
    tft.drawCentreString("Delete from history?", scrW() / 2, pop_y + 10, 2);

    int16_t btn_y  = pop_y + 44;
    int16_t btn_h  = 28;
    int16_t half_w = pop_w / 2 - 6;
    int16_t del_x  = pop_x + pop_w / 2 + 2;

    tft.fillRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(pop_x + 4, btn_y, half_w, btn_h, 4, dim_fg());
    drawSmallCentered("Cancel", pop_x + 4 + half_w / 2, btn_y, btn_h, TFT_WHITE, hdr_bg());

    tft.fillRoundRect(del_x, btn_y, half_w, btn_h, 4, hdr_bg());
    tft.drawRoundRect(del_x, btn_y, half_w, btn_h, 4, TFT_RED);
    drawSmallCentered("Delete", del_x + half_w / 2, btn_y, btn_h, TFT_RED, hdr_bg());
}

// Renders one search result row INTO the caller-provided sprite `spr` (sized
// row_w × srchH) at sprite-local coordinates: reference on the top line, snippet
// (with highlighted query text) on the second. The caller then pushSprite()s it —
// this off-screen-then-blit approach gives flicker-free scrolling like the reading
// view (drawGlyph writes straight to hardware, so smooth text must use printToSprite).
// `y_px` is the row's screen Y, used only for the alternating divider colour.
void BibleInterface::drawSearchResultRow(TFT_eSprite& spr, int16_t y_px, uint16_t idx, bool sel) {
    const int16_t SBAR_W  = 6;
    const int16_t PADDING = 4;
    int16_t row_w = (int16_t)scrW() - SBAR_W;
    int16_t row_h = (int16_t)srchH();

    uint16_t bg_col = sel ? sel_bg() : bg();
    spr.fillSprite(bg_col);
    // Divider line at bottom of row
    spr.drawFastHLine(0, row_h - 1, row_w, edgeColor(y_px / (int16_t)srchH(), dim_fg()));

    // Reference line (song title / dict headword / verse ref). Rendered via the
    // sprite's smooth font so umlauts/ligatures (private codes) display correctly.
    {
        BibleSearchResult& r = search_results[idx];
        char ref[48];
        if (mode == MODE_DICT) {
            // Show the entry headword (text before " - " in the "word - definition" pair).
            const char* dash = strstr(r.snippet, " - ");
            size_t len = dash ? (size_t)(dash - r.snippet) : strlen(r.snippet);
            if (len > sizeof(ref) - 1) len = sizeof(ref) - 1;
            memcpy(ref, r.snippet, len); ref[len] = 0;
        } else if (mode == MODE_SONGS) {
            if (r.trans == cur_trans) {
                snprintf(ref, sizeof(ref), "%s", bookDisplay(r.book));  // song title
            } else {
                // "All" hit in another songbook — show the songbook's display name
                // (with real umlauts from the .toc, not the ASCII-folded filename
                // stem where ä→ae etc.), uppercased.
                strncpy(ref, (r.trans < trans_count) ? trans_names[r.trans] : "?", sizeof(ref) - 1);
                ref[sizeof(ref) - 1] = 0;
                for (char* p = ref; *p; ++p) {
                    uint8_t c = (uint8_t)*p;
                    if      (c < 0x80)  *p = (char)toupper(c);   // ASCII → upper
                    else if (c == 0x81) *p = (char)0x80;         // ä → Ä
                    else if (c == 0x83) *p = (char)0x82;         // ö → Ö
                    else if (c == 0x85) *p = (char)0x84;         // ü → Ü
                    // 0x86 (ß) has no uppercase form; other codes unchanged
                }
            }
        } else {
            snprintf(ref, sizeof(ref), "%s %d:%d",
                     bookDisplay(r.book), (int)r.chapter, (int)r.verse);
        }
        // Fraktur song titles render in the blackletter title font; songbook-name
        // refs (cross-book "All" hits) stay in the normal font — names never Fraktur.
        bool refIsSongTitle = (mode == MODE_SONGS && r.trans == cur_trans);
        const uint8_t* titleFont =
            ((refIsSongTitle && transIsFraktur(r.trans)) ? FRAKT_FONTS : VLW_FONTS)[1].data;
        spr.loadFont(titleFont); g_ui_vlw = titleFont;
        spr.setTextColor(fg(), bg_col);
        spr.setCursor(PADDING, 3);
        char ru8[sizeof(ref) * 3];                       // private codes → UTF-8 for printToSprite
        vlwPrivToUtf8(ref, ru8, sizeof(ru8));
        spr.printToSprite(ru8, strlen(ru8));             // clipped at the sprite edge
    }

    // Snippet in the Tiny font with highlighted query segments.
    // disp/qdisp hold ASCII base letters (for case-insensitive match); snip holds
    // the original private codes so rendering shows proper umlauts/ß.
    // Private codes are 1-byte just like ASCII, so indices are identical between
    // snip and disp — we match on disp, render from snip.
    int16_t snip_y = 20;
    const char* snip = search_results[idx].snippet;

    static const char bases[] = {'A','a','O','o','U','u','B'};
    char disp[BIBLE_SRCH_SNIPPET_LEN];
    {
        const char* src = snip;
        size_t di = 0;
        for (; *src && di < BIBLE_SRCH_SNIPPET_LEN - 1; src++) {
            uint8_t bc = (uint8_t)*src;
            disp[di++] = (bc >= 0x80 && bc <= 0x86) ? bases[bc - 0x80] : *src;
        }
        disp[di] = 0;
    }
    char qdisp[BIBLE_SEARCH_QUERY_LEN];
    {
        const char* qs = search_query;
        size_t qi = 0;
        for (; *qs && qi < BIBLE_SEARCH_QUERY_LEN - 1; qs++) {
            uint8_t bc = (uint8_t)*qs;
            qdisp[qi++] = (bc >= 0x80 && bc <= 0x86) ? bases[bc - 0x80] : *qs;
        }
        qdisp[qi] = 0;
    }
    size_t qlen = strlen(qdisp);

    // Build the set of tokens to highlight.
    // Phrase mode: one token = the full (possibly punct-stripped) query.
    // Partial mode: one token per space-delimited word.
    // Each token is punct-stripped when srch_ignore_punct is on.
    struct Token { char s[BIBLE_SEARCH_QUERY_LEN]; size_t len; };
    Token  tokens[16];
    int    ntokens = 0;

    // Source string for splitting: qdisp (private-codes mapped to ASCII bases)
    // with punctuation stripped if needed.
    char qbase[BIBLE_SEARCH_QUERY_LEN];  // punct-stripped qdisp
    {
        size_t qi = 0;
        for (size_t i = 0; qdisp[i] && qi < BIBLE_SEARCH_QUERY_LEN - 1; i++) {
            uint8_t c = (uint8_t)qdisp[i];
            if (srch_ignore_punct && c < 0x80 && ispunct((int)c)) continue;
            qbase[qi++] = qdisp[i];
        }
        qbase[qi] = 0;
    }

