H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    if (srch_partial_match) {
        const char* p = qbase;
        while (*p && ntokens < 16) {
            while (*p == ' ') p++;
            if (!*p) break;
            const char* ws = p;
            while (*p && *p != ' ') p++;
            size_t wl = (size_t)(p - ws);
            if (wl > 0 && wl < BIBLE_SEARCH_QUERY_LEN) {
                memcpy(tokens[ntokens].s, ws, wl);
                tokens[ntokens].s[wl] = 0;
                tokens[ntokens].len   = wl;
                ntokens++;
            }
        }
    } else {
        size_t bl = strlen(qbase);
        if (bl > 0) {
            memcpy(tokens[0].s, qbase, bl + 1);
            tokens[0].len = bl;
            ntokens = 1;
        }
    }

    spr.setTextDatum(TL_DATUM);
    // Snippet is song body text — render Fraktur books in the blackletter body font
    // (matches the reading view; makes ligatures like tz display correctly).
    bool snipFrak = (mode == MODE_SONGS && transIsFraktur(search_results[idx].trans));
    const uint8_t* snipFont = (snipFrak ? FRAK_FONTS : VLW_FONTS)[0].data;  // Tiny
    spr.loadFont(snipFont); g_ui_vlw = snipFont;
    const int16_t tiny_lh = (int16_t)(snipFrak ? FRAK_FONTS[0].lineH : VLW_FONTS[0].lineH);
    const size_t  slen    = strlen(disp);  // disp and snip share indices (1 byte each)

    // Pass 1: mark which snippet characters fall inside a matched token.
    bool hl[BIBLE_SRCH_SNIPPET_LEN];
    memset(hl, 0, sizeof(hl));
    for (size_t si = 0; si < slen; ) {
        bool   found     = false;
        size_t match_end = 0;
        for (int t = 0; t < ntokens && !found; t++) {
            const char* tok = tokens[t].s;
            size_t      tl  = tokens[t].len;
            if (tl == 0) continue;
            if (srch_ignore_punct) {
                size_t qi = 0, di = si;
                while (qi < tl) {
                    while (disp[di] && (uint8_t)disp[di] < 0x80 && ispunct((int)(uint8_t)disp[di])) di++;
                    if (!disp[di]) break;
                    if (tolower((uint8_t)disp[di]) != tolower((uint8_t)tok[qi])) break;
                    di++; qi++;
                }
                if (qi == tl) { found = true; match_end = di; }
            } else {
                bool m = true;
                for (size_t j = 0; j < tl && m; j++)
                    if (!disp[si + j] || tolower((uint8_t)disp[si + j]) != tolower((uint8_t)tok[j])) m = false;
                if (m) { found = true; match_end = si + tl; }
            }
        }
        if (found) { for (size_t j = si; j < match_end && j < slen; j++) hl[j] = true; si = match_end; }
        else si++;
    }

    // Character advance in the loaded Tiny font.
    auto charAdv = [&](uint8_t c) -> int16_t {
        if (c == ' ') return vlwSpaceWidth(g_ui_vlw);
        int16_t a = vlwAdvance(g_ui_vlw, vlwPrivToUnicode(c));
        return (a < 0) ? (int16_t)(vlwSpaceWidth(g_ui_vlw) + 1) : a;
    };

    // Pass 2: word-wrap over two lines. max_sx already excludes the scrollbar, so
    // words break before it. A word wider than a line falls back to char breaks.
    int16_t sx     = PADDING;
    int16_t max_sx = row_w - PADDING;
    int16_t cur_y  = snip_y;
    uint8_t sline  = 0;
    const uint16_t norm_col = sel ? fg() : dim_fg();
    for (size_t i = 0; i < slen; ) {
        size_t ws = i;
        while (i < slen && snip[i] != ' ') i++;   // word
        size_t we = i;
        while (i < slen && snip[i] == ' ') i++;   // trailing spaces
        int16_t word_w = 0;
        for (size_t k = ws; k < we; k++) word_w += charAdv((uint8_t)snip[k]);
        if (sx > PADDING && sx + word_w > max_sx) {           // whole word won't fit → wrap
            if (sline == 0) { sline = 1; sx = PADDING; cur_y = snip_y + tiny_lh; }
            else break;
        }
        bool stop = false;
        for (size_t k = ws; k < we && !stop; k++) {           // draw word (char-wrap if huge)
            int16_t cw = charAdv((uint8_t)snip[k]);
            if (sx + cw > max_sx) {
                if (sline == 0) { sline = 1; sx = PADDING; cur_y = snip_y + tiny_lh; }
                else { stop = true; break; }
            }
            uint16_t col = hl[k] ? (uint16_t)0xFD20 : norm_col;
            spr.setTextColor(col, bg_col);
            spr.setCursor(sx, cur_y);
            char one[2] = { snip[k], 0 };
            char cu8[8];
            vlwPrivToUtf8(one, cu8, sizeof(cu8));
            spr.printToSprite(cu8, strlen(cu8));
            sx += charAdv((uint8_t)snip[k]);
        }
        if (stop) break;
        for (size_t k = we; k < i && sx > PADDING; k++)       // advance past spaces (no draw)
            sx += charAdv((uint8_t)snip[k]);
    }
    // Font/g_ui_vlw are left on the sprite's snippet font; the caller restores the
    // UI font (setUiFont) after the row loop, before drawing chrome.
}

// Partial redraw of search result list (no header/nav repaint).
// Each row is rendered into an off-screen sprite and blitted atomically, so
// scrolling is flicker-free like the reading view (no per-row fill-then-draw ripple).
// A viewport clips the partial top/bottom rows at the header/nav edges.
void BibleInterface::redrawSearchResultsContent() {
    int16_t sub_px    = (int16_t)fmodf(scroll_px, (float)srchH());
    int16_t first     = (int16_t)(scroll_px / (float)srchH());
    int16_t cTop      = (int16_t)contentY();
    int16_t cEnd      = cTop + (int16_t)contentH();
    int16_t row_w     = (int16_t)scrW() - 6;   // leave the 6px scrollbar column

    TFT_eSprite row_spr(&tft);
    if (!row_spr.createSprite(row_w, (int16_t)srchH())) {
        // Low memory — clear the zone rather than render garbage.
        tft.fillRect(0, cTop, scrW(), contentH(), bg());
        drawScrollBar(search_result_count, visSearchItems(), first);
        return;
    }
    row_spr.setTextWrap(false, false);

    tft.setViewport(0, cTop, scrW(), contentH(), false);   // clips partial rows
    int16_t last_bottom = cTop;
    for (int i = 0; ; i++) {
        int16_t idx = first + i;
        int16_t y   = cTop - sub_px + i * (int16_t)srchH();
        if (y >= cEnd || idx >= (int16_t)search_result_count) break;
        drawSearchResultRow(row_spr, y, (uint16_t)idx, idx == search_res_sel);
        row_spr.pushSprite(0, y);
        int16_t bot = y + (int16_t)srchH();
        if (bot > last_bottom) last_bottom = bot;
    }
    tft.resetViewport();
    row_spr.deleteSprite();
    ui_font_idx = -1;   // row renderer loaded fonts on the sprite + moved g_ui_vlw;
    setUiFont(2);       // force a real reload so tft font + g_ui_vlw are restored

    // Clear any unused space below the last row (list shorter than content zone)
    if (last_bottom < cEnd)
        tft.fillRect(0, last_bottom, row_w, cEnd - last_bottom, bg());
    drawScrollBar(search_result_count, visSearchItems(), first);
}

void BibleInterface::drawSearchResults() {
    tft.fillScreen(bg());
    char hdr[32];
    if (search_result_count >= BIBLE_MAX_SEARCH_RESULTS)
        snprintf(hdr, sizeof(hdr), "%d+ Results", BIBLE_MAX_SEARCH_RESULTS);
    else
        snprintf(hdr, sizeof(hdr), "%d Results", (int)search_result_count);
    drawHeader(hdr, true);

    if (search_result_count == 0) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("No matches found", scrW() / 2, contentY() + 30, 2);
        drawNavBar("Back", "", "");
        return;
    }

    uint8_t vis = visSearchItems();
    int16_t row_w = (int16_t)scrW() - 6;   // leave the 6px scrollbar column
    TFT_eSprite row_spr(&tft);
    if (row_spr.createSprite(row_w, (int16_t)srchH())) {
        row_spr.setTextWrap(false, false);
        for (uint8_t i = 0; i < vis && (menu_scroll + i) < search_result_count; i++) {
            uint16_t idx = menu_scroll + i;
            int16_t  y   = (int16_t)(contentY() + i * srchH());
            drawSearchResultRow(row_spr, y, idx, idx == (uint16_t)search_res_sel);
            row_spr.pushSprite(0, y);
        }
        row_spr.deleteSprite();
        ui_font_idx = -1;   // restore UI font/g_ui_vlw after the sprite renderer
    }
    setUiFont(2);
    drawScrollBar(search_result_count, vis, menu_scroll);
    drawNavBar("Back", "", "View");
}

// Progress bar drawn during searchBible() — called ~every 8 KB of XML read.
// The border is drawn only on the first call (done==0) to avoid repainting gray
// over the bar interior on every update, which caused a strobing gray flash.
// Small live "DRAM: NN%  PSRAM: NN%" readout (used% of each pool), centred at y.
void BibleInterface::drawMemUsage(int16_t y) {
    uint32_t dtot = ESP.getHeapSize();
    uint32_t dfree = ESP.getFreeHeap();
    int dpct = (dtot > 0) ? (int)(100UL * (dtot - dfree) / dtot) : 0;

    char buf[40];
#ifdef HAS_PSRAM
    uint32_t ptot = ESP.getPsramSize();
    uint32_t pfree = ESP.getFreePsram();
    int ppct = (ptot > 0) ? (int)(100UL * (ptot - pfree) / ptot) : 0;
    if (ptot > 0) snprintf(buf, sizeof(buf), "D-RAM: %d%%   PSRAM: %d%%", dpct, ppct);
    else          snprintf(buf, sizeof(buf), "D-RAM: %d%%   PSRAM: n/a", dpct);
#else
    snprintf(buf, sizeof(buf), "D-RAM: %d%%", dpct);
#endif
    // Repaint a clean strip (X-Small height) so the value updates without ghosting.
    setUiFont(1);
    tft.fillRect(0, y, scrW(), (int16_t)VLW_FONTS[1].lineH + 2, bg());
    tft.setTextColor(dim_fg(), bg());
    tft.drawCentreString(buf, scrW() / 2, y, 1);
    setUiFont(2);
}

void BibleInterface::drawSearchProgress(uint32_t done, uint32_t total) {
    int16_t bar_x = 10;
    int16_t bar_y = (int16_t)(contentY() + contentH() / 2 + 8);
    int16_t bar_w = (int16_t)scrW() - 20;
    int16_t bar_h = 14;

    // Draw border + empty interior only once at the start
    if (done == 0) {
        tft.fillRect(bar_x - 1, bar_y - 1, bar_w + 2, bar_h + 2, dim_fg());
        tft.fillRect(bar_x, bar_y, bar_w, bar_h, bg());
    }

    // Fill from left: green up to `filled`, then bg() for the remainder.
    // Drawing in this order avoids a full-bar clear that would flash the background.
    int16_t filled = 0;
    if (total > 0) {
        filled = (int16_t)((uint32_t)bar_w * done / total);
        if (filled > bar_w) filled = bar_w;
        if (filled > 0)
            tft.fillRect(bar_x, bar_y, filled, bar_h, (uint16_t)0x07E0);
    }
    if (filled < bar_w)
        tft.fillRect(bar_x + filled, bar_y, bar_w - filled, bar_h, bg());

