H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    char pct[12];
    if (total > 0)
        snprintf(pct, sizeof(pct), "%d%%", (int)(100UL * done / total));
    else
        snprintf(pct, sizeof(pct), "...");
    // Clear the previous number's band first (smooth text doesn't fill its bg, so a
    // shorter value would otherwise leave the old digits behind).
    int16_t pct_y = bar_y + bar_h + 2;
    tft.fillRect(0, pct_y, scrW(), (int16_t)VLW_FONTS[1].lineH + 2, bg());
    drawSmallCentered(pct, scrW() / 2, pct_y, (int16_t)VLW_FONTS[1].lineH, fg(), bg());

    // Live memory usage near the top of the content area (updates every call).
    drawMemUsage((int16_t)contentY() + 4);
}

// ─────────────────────────────────────────────────────────────────────────────
// Search — input handlers
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::handleSearchInputInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Delete confirmation popup ─────────────────────────────────────────────
    if (search_del_pending) {
        if (down && !touch_was_down) {
            touch_was_down = true;
            touch_down_x = tx;
            touch_down_y = ty;
        } else if (!down && touch_was_down) {
            touch_was_down = false;
            // Recompute Delete button bounds (must match drawSearchDelConfirm)
            int16_t pop_w  = (int16_t)scrW() - 40;
            int16_t pop_x  = 20;
            int16_t pop_y  = (int16_t)(scrH() / 2) - 40;
            int16_t btn_y  = pop_y + 44;
            int16_t btn_h  = 28;
            int16_t half_w = pop_w / 2 - 6;
            int16_t del_x  = pop_x + pop_w / 2 + 2;
            bool in_del = ((int16_t)touch_down_x >= del_x &&
                           (int16_t)touch_down_x <  del_x + half_w &&
                           (int16_t)touch_down_y >= btn_y &&
                           (int16_t)touch_down_y <  btn_y + btn_h);
            if (in_del && search_hist_count > 0 &&
                search_hist_sel >= 0 &&
                search_hist_sel < (int16_t)search_hist_count) {
                for (uint8_t i = (uint8_t)search_hist_sel;
                     i < search_hist_count - 1; i++)
                    memcpy(search_hist[i], search_hist[i + 1],
                           BIBLE_SEARCH_QUERY_LEN);
                search_hist_count--;
                if (search_hist_sel >= (int16_t)search_hist_count &&
                    search_hist_sel > 0)
                    search_hist_sel--;
                saveSearchHistory();
            }
            search_del_pending = false;
            needs_redraw = true;
        }
        return;
    }

    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) { goBack(); return; }
            // Dictionary: tap the header title to switch which dictionary is searched.
            if (mode == MODE_DICT && trans_count > 1) {
                cur_trans = (cur_trans + 1) % trans_count;
                prefs.putUChar("trans", cur_trans);
                loadToc(trans_stems[cur_trans]);
                cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
                if (cur_book >= numBooks()) cur_book = 0;
                cur_sec = (numBooks() > 0) ? bookSection(cur_book) : 0;
                needs_redraw = true;
            }
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            uint16_t third = scrW() / 3;
            if (tx < third) {
                // New — open a fresh keyboard, run search if confirmed
                search_query[0] = 0;
                if (openSearchKeyboard() && search_query[0]) {
                    addToSearchHistory(search_query, mode == MODE_SONGS && g_read_fraktur);
                    if (searchBible(search_query)) goToSearchResults();
                    else                           needs_redraw = true;
                } else {
                    needs_redraw = true;
                }
                return;
            } else if (tx < 2 * third) {
                // View — open the keyboard pre-filled with the selected history
                // item so the user can edit the query/options before searching.
                if (search_hist_sel >= 0 &&
                    search_hist_sel < (int16_t)search_hist_count) {
                    strncpy(search_query, search_hist[search_hist_sel],
                            BIBLE_SEARCH_QUERY_LEN - 1);
                    search_query[BIBLE_SEARCH_QUERY_LEN - 1] = 0;
                    if (openSearchKeyboard() && search_query[0]) {
                        addToSearchHistory(search_query, mode == MODE_SONGS && g_read_fraktur);
                        if (searchBible(search_query)) goToSearchResults();
                        else                           needs_redraw = true;
                    } else {
                        needs_redraw = true;
                    }
                }
                return;
            } else {
                // Del — show confirmation popup
                if (search_hist_count > 0 &&
                    search_hist_sel >= 0 &&
                    search_hist_sel < (int16_t)search_hist_count) {
                    search_del_pending = true;
                    needs_redraw = true;
                }
                return;
            }
        }
        // Highlight the touched history item
        int16_t hi = touchItem(tx, ty);
        if (hi >= 0 && (menu_scroll + hi) < (int16_t)search_hist_count) {
            search_hist_sel = menu_scroll + hi;
            redrawListContent(search_hist_count);
        }
        return;
    }

    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
            search_hist_sel = -1;
        }
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)search_hist_count - (int)visItems())
                           * (float)itemH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px   = new_px;
            menu_scroll = (int16_t)(scroll_px / (float)itemH());
            recordVel((int16_t)ty, millis());
            redrawListContent(search_hist_count);
        }
        return;
    }

