H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
        size_t qi = 0;
        for (const char* p = query; *p && qi < BIBLE_SEARCH_QUERY_LEN - 1; p++) {
            uint8_t c = (uint8_t)*p;
            if ((c < 0x80 && ispunct((int)c)) || (c >= 0x87 && c <= 0x8E)) continue;  // + typographic marks
            q2[qi++] = *p;
        }
        q2[qi] = 0;
        q = q2;
        if (!q[0]) return false;
    }

    // Inline helper: does word w[0..wl) appear anywhere in t?
    auto wordIn = [](const char* t_, const char* w, size_t wl) -> bool {
        for (size_t i = 0; t_[i]; i++) {
            bool m = true;
            for (size_t j = 0; j < wl && m; j++) {
                if (!t_[i + j]) { m = false; break; }
                uint8_t tc = (uint8_t)t_[i + j];
                uint8_t qc = (uint8_t)w[j];
                if (tc >= 0x80 || qc >= 0x80) { if (tc != qc) m = false; }
                else if (tolower((int)tc) != tolower((int)qc)) m = false;
            }
            if (m) return true;
        }
        return false;
    };

    if (srch_partial_match) {
        // Every space-delimited word in q must appear somewhere in t (any order/position)
        const char* p = q;
        while (*p) {
            while (*p == ' ') p++;
            if (!*p) break;
            const char* ws = p;
            while (*p && *p != ' ') p++;
            size_t wl = (size_t)(p - ws);
            if (wl == 0) continue;
            if (!wordIn(t, ws, wl)) return false;
        }
        return true;
    }

    // Exact phrase match
    size_t qlen = strlen(q);
    for (size_t i = 0; t[i]; i++) {
        bool match = true;
        for (size_t j = 0; j < qlen; j++) {
            if (!t[i + j]) { match = false; break; }
            uint8_t tc = (uint8_t)t[i + j];
            uint8_t qc = (uint8_t)q[j];
            if (tc >= 0x80 || qc >= 0x80) {
                if (tc != qc) { match = false; break; }
            } else {
                if (tolower((int)tc) != tolower((int)qc)) { match = false; break; }
            }
        }
        if (match) return true;
    }
    return false;
}

bool BibleInterface::openSearchKeyboard() {
#ifdef HAS_TOUCH
    const char* kb_title = (mode == MODE_SONGS) ? "Search Songs:"
                         : (mode == MODE_DICT)  ? "Search word:"
                                                : "Search Bible:";
    // Translation / songbook / dictionary picker (shown when there are 2+ files):
    // tap it to switch which one is searched. Use each file's real display name
    // (from the .toc, umlauts included) converted from private codes to UTF-8 so
    // the keyboard's smooth-font drawString renders the umlaut glyphs.
    char names_buf[BIBLE_MAX_TRANS][BIBLE_TRANS_DISP_LEN * 2];  // UTF-8 ≈ up to 2×
    const char* names[BIBLE_MAX_TRANS];
    for (uint8_t i = 0; i < trans_count; i++) {
        vlwPrivToUtf8(trans_names[i], names_buf[i], sizeof(names_buf[i]));
        names[i] = names_buf[i];
    }
    const char* pick_label = (mode == MODE_SONGS) ? "Book:"
                           : (mode == MODE_DICT)  ? "Dict:" : "Trans:";
    uint8_t dsel = cur_trans;

    bool ok;
    if (mode == MODE_DICT) {
        // Dictionary auto-scopes to the query's letter bucket (no scope row).
        ok = bibleKeyboardInput(tft, fg(), bg(), search_query, BIBLE_SEARCH_QUERY_LEN,
                                kb_title, &srch_partial_match, &srch_ignore_punct,
                                nullptr, nullptr, nullptr, 0,
                                names, trans_count, &dsel, pick_label);
    } else if (mode == MODE_SONGS) {
        static const char* const FIND[3] = { "All", "Title", "Body" };
        if (srch_scope > 2) srch_scope = 0;
        // Fraktur songbook: render the keyboard in the blackletter font (matched
        // size to g_kb_font_main = VLW_FONTS[2]) with the ligature symbol page.
        const uint8_t* frak = g_read_fraktur ? FRAK_FONTS[2].data : nullptr;
        ok = bibleKeyboardInput(tft, fg(), bg(), search_query, BIBLE_SEARCH_QUERY_LEN,
                                kb_title, &srch_partial_match, &srch_ignore_punct,
                                &srch_scope, "Find:", FIND, 3,
                                names, trans_count, &dsel, pick_label, frak);
    } else {  // Bible — default scope row (Bible / Section / Book) + translation picker
        ok = bibleKeyboardInput(tft, fg(), bg(), search_query, BIBLE_SEARCH_QUERY_LEN,
                                kb_title, &srch_partial_match, &srch_ignore_punct,
                                &srch_scope, nullptr, nullptr, 0,
                                names, trans_count, &dsel, pick_label);
    }

    // Apply a translation switch made in the picker (any mode).
    if (dsel != cur_trans && dsel < trans_count) {
        cur_trans = dsel;
        prefs.putUChar("trans", cur_trans);
        cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
        book_idx_valid = false;
        if (mode != MODE_BIBLE) {
            loadToc(trans_stems[cur_trans]);
            if (cur_book >= numBooks()) cur_book = 0;
            cur_sec = (numBooks() > 0) ? bookSection(cur_book) : 0;
        } else if (cur_book >= numBooks()) {
            cur_book = 0;
            cur_sec  = bookSection(cur_book);
        }
    }
    // Persist option changes the user made inside the keyboard.
    prefs.putBool ("srch_part", srch_partial_match);
    prefs.putBool ("srch_pnct", srch_ignore_punct);
    prefs.putUChar("srch_scp",  srch_scope);
    return ok;
#else
    return false;
#endif
}

bool BibleInterface::searchBible(const char* query) {
    search_result_count = 0;
    search_res_sel      = 0;
    if (!search_results) return false;   // allocation failed at boot — no search
    if (trans_count == 0 || !query || !query[0]) return false;

    // Songs "All": body scan across every songbook (handled in its own method).
    if (mode == MODE_SONGS && srch_scope == 0)
        return searchSongsAll(query);   // false = user cancelled

    // Songs "Title" search: match song titles directly (instant, no XML scan).
    if (mode == MODE_SONGS && srch_scope == 1) {
        for (uint16_t b = 0; b < numBooks() &&
                             search_result_count < BIBLE_MAX_SEARCH_RESULTS; b++) {
            if (searchContains(bookDisplay(b), query)) {
                BibleSearchResult r;
                r.book = b; r.chapter = 1; r.verse = 1; r.trans = cur_trans;
                strncpy(r.snippet, bookDisplay(b), BIBLE_SRCH_SNIPPET_LEN - 1);
                r.snippet[BIBLE_SRCH_SNIPPET_LEN - 1] = 0;
                search_results[search_result_count++] = r;
            }
        }
        return true;
    }

    // Show search progress screen
    tft.fillScreen(bg());
    drawHeader("Searching...", false);
    // Show query centred, rendering umlauts/ß properly
    {
        int16_t qw = textWidthUTF8(query, 2);
        int16_t qx = (int16_t)(scrW() / 2) - qw / 2;
        int16_t qy = (int16_t)(contentY() + contentH() / 2 - 20);
        tft.setTextColor(fg(), bg());
        for (const char* p = query; *p; p++)
            qx += tftCharUTF8(tft, (uint8_t)*p, qx, qy, 2, fg());
    }
    drawSearchProgress(0, 1);

    // Draw Cancel button once — stays visible; progress updates don't overlap it.
    // Geometry must match the hit-test inside the parse loop below.
    const int16_t CBTN_W = 80, CBTN_H = 26;
    const int16_t cbtn_bar_y = (int16_t)(contentY() + contentH() / 2 + 8);
    const int16_t cbtn_x     = (int16_t)(scrW() / 2) - CBTN_W / 2;
    const int16_t cbtn_y     = cbtn_bar_y + 14 + 18 + 20;  // below bar + pct-text, + 20px gap
    tft.fillRoundRect(cbtn_x, cbtn_y, CBTN_W, CBTN_H, 4, hdr_bg());
    tft.drawRoundRect(cbtn_x, cbtn_y, CBTN_W, CBTN_H, 4, dim_fg());
    drawSmallCentered("Cancel", (int16_t)(scrW() / 2), cbtn_y, CBTN_H, fg(), hdr_bg());

    char path[64];
    snprintf(path, sizeof(path), "%s/%s.xml", basePath(), trans_stems[cur_trans]);
    File f = SD.open(path);
    if (!f) return false;

