H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // A Fraktur search stays within Fraktur songbooks (and a normal search within
    // normal ones) — the two use different glyph encodings, so mixing them would
    // render garbled. Match the songbook the user searched from.
    const bool want_frak = transIsFraktur(saved_trans);

    bool cancelled = false;
    for (uint8_t t = 0; t < trans_count && !cancelled &&
                        search_result_count < BIBLE_MAX_SEARCH_RESULTS; t++) {
        if (transIsFraktur(t) != want_frak) continue;   // don't cross the Fraktur/normal line
        if (!loadToc(trans_stems[t])) continue;   // need this file's codes
        char path[64];
        snprintf(path, sizeof(path), "%s/%s.xml", basePath(), trans_stems[t]);
        File f = SD.open(path);
        if (!f) continue;
        uint32_t fsize = (uint32_t)f.size();
        uint32_t lastu = 0;

        XmlState s; memset(&s, 0, sizeof(s)); s.f = f;
        enum { ST_TEXT, ST_TAG } st = ST_TEXT;
        char tag_buf[XML_TAG_BUF]; int tag_len = 0;
        bool in_verse = false, in_note = false;
        char vtext[BIBLE_VERSE_BUF]; int vtext_len = 0;
        uint16_t vb = 0, vc = 0; uint8_t vv = 0;
        char c;
        while (xmlNextByte(s, c)) {
            uint32_t pos = (uint32_t)f.position();
            if (pos - lastu >= 16384) {
                lastu = pos;
                drawSearchProgress((uint32_t)t * 100 + (fsize ? 100UL * pos / fsize : 0),
                                   (uint32_t)trans_count * 100);
                yield();
                uint16_t cx, cy;
                if (pollTouch(&cx, &cy) &&
                    (int16_t)cx >= cbtn_x && (int16_t)cx < cbtn_x + CBTN_W &&
                    (int16_t)cy >= cbtn_y && (int16_t)cy < cbtn_y + CBTN_H) {
                    cancelled = true; break;   // exit this file's scan
                }
            }
            if (st == ST_TEXT) {
                if (c == '<') { st = ST_TAG; tag_len = 0; continue; }
                if (in_verse && !in_note && vtext_len < BIBLE_VERSE_BUF - 2) vtext[vtext_len++] = c;
            } else {
                if (c == '>') {
                    st = ST_TEXT; tag_buf[tag_len] = 0;
                    bool closing = (tag_buf[0] == '/');
                    const char* tn = closing ? tag_buf + 1 : tag_buf;
                    if (tag_buf[0] == '?' || tag_buf[0] == '!') { tag_len = 0; continue; }
                    if (!closing) {
                        bool sc = (tag_len > 0 && tag_buf[tag_len - 1] == '/');
                        if (sc) tag_buf[--tag_len] = 0;
                        if (strncmp(tn, "verse", 5) == 0 &&
                            (tn[5] == ' ' || tn[5] == '\t' || tn[5] == 0)) {
                            char oid[64] = {0};
                            if (xmlGetAttr(tag_buf, "osisID", oid, sizeof(oid))) {
                                uint16_t bk = 0, ch = 0; uint8_t vs = 0;
                                if (parseOsisID(oid, bk, ch, vs)) {
                                    vb = bk; vc = ch; vv = vs;
                                    in_verse = !sc; in_note = false; vtext_len = 0;
                                }
                            }
                        } else if (in_verse && strncmp(tn, "note", 4) == 0) {
                            in_note = true;
                        }
                    } else {
                        if (strncmp(tn, "verse", 5) == 0 && in_verse) {
                            vtext[vtext_len] = 0;
                            xmlDecodeEntities(vtext, BIBLE_VERSE_BUF);
                            utf8Encode(vtext);
                            if (searchContains(vtext, query) &&
                                search_result_count < BIBLE_MAX_SEARCH_RESULTS) {
                                BibleSearchResult r;
                                r.book = vb; r.chapter = vc; r.verse = vv; r.trans = t;
                                strncpy(r.snippet, vtext, BIBLE_SRCH_SNIPPET_LEN - 1);
                                r.snippet[BIBLE_SRCH_SNIPPET_LEN - 1] = 0;
                                search_results[search_result_count++] = r;
                            }
                            in_verse = false; in_note = false; vtext_len = 0;
                        } else if (in_verse && strncmp(tn, "note", 4) == 0) {
                            in_note = false;
                        }
                    }
                    tag_len = 0;
                } else if (tag_len < XML_TAG_BUF - 1) {
                    tag_buf[tag_len++] = c;
                }
            }
        }
        f.close();
    }

    // Restore the songbook that was open before the search.
    cur_trans = saved_trans;
    loadToc(trans_stems[cur_trans]);
    if (cancelled) {
        search_result_count = 0;
        needs_redraw = true;
        return false;
    }
    drawSearchProgress((uint32_t)trans_count * 100, (uint32_t)trans_count * 100);
    return true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Search — history persistence
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::addToSearchHistory(const char* query, bool frak) {
    if (!query || !query[0]) return;
    // Deduplicate: if already present, move to front
    for (uint8_t i = 0; i < search_hist_count; i++) {
        if (strcmp(search_hist[i], query) == 0) {
            for (uint8_t j = i; j > 0; j--) {
                memcpy(search_hist[j], search_hist[j - 1], BIBLE_SEARCH_QUERY_LEN);
                search_hist_frak[j] = search_hist_frak[j - 1];
            }
            strncpy(search_hist[0], query, BIBLE_SEARCH_QUERY_LEN - 1);
            search_hist[0][BIBLE_SEARCH_QUERY_LEN - 1] = 0;
            search_hist_frak[0] = frak;
            saveSearchHistory();
            return;
        }
    }
    // Insert at front, shifting existing entries (oldest drops off if full)
    uint8_t new_count = (search_hist_count < BIBLE_SEARCH_HIST_MAX)
                        ? search_hist_count + 1
                        : BIBLE_SEARCH_HIST_MAX;
    for (uint8_t i = new_count - 1; i > 0; i--) {
        memcpy(search_hist[i], search_hist[i - 1], BIBLE_SEARCH_QUERY_LEN);
        search_hist_frak[i] = search_hist_frak[i - 1];
    }
    strncpy(search_hist[0], query, BIBLE_SEARCH_QUERY_LEN - 1);
    search_hist[0][BIBLE_SEARCH_QUERY_LEN - 1] = 0;
    search_hist_frak[0] = frak;
    search_hist_count = new_count;
    saveSearchHistory();
}

void BibleInterface::saveSearchHistory() {
    char path[64];
    srchHistPath(path, sizeof(path));
    SD.remove(path);
    File f = SD.open(path, FILE_WRITE);
    if (!f) return;
    for (uint8_t i = 0; i < search_hist_count; i++) {
        // Format: "<0|1>\t<query>" — the leading flag marks a Fraktur search so the
        // entry renders in the Fraktur font. (No keyboard key emits a tab, so the
        // delimiter is unambiguous; old flagless files still load, defaulting to 0.)
        f.write(search_hist_frak[i] ? '1' : '0');
        f.write('\t');
        f.print(search_hist[i]);
        f.write('\n');
    }
    f.close();
}

void BibleInterface::loadSearchHistory() {
    search_hist_count = 0;
    char path[64];
    srchHistPath(path, sizeof(path));
    File f = SD.open(path);
    if (!f) return;
    while (f.available() && search_hist_count < BIBLE_SEARCH_HIST_MAX) {
        String line = f.readStringUntil('\n');
        line.trim();
        bool frak = false;
        const char* q = line.c_str();
        // Strip the "<0|1>\t" prefix if present; older files have none.
        if (line.length() >= 2 && line[1] == '\t' && (line[0] == '0' || line[0] == '1')) {
            frak = (line[0] == '1');
            q += 2;
        }
        size_t qlen = strlen(q);
        if (qlen == 0 || qlen >= BIBLE_SEARCH_QUERY_LEN) continue;
        strncpy(search_hist[search_hist_count], q, BIBLE_SEARCH_QUERY_LEN - 1);
        search_hist[search_hist_count][BIBLE_SEARCH_QUERY_LEN - 1] = 0;
        search_hist_frak[search_hist_count] = frak;
        search_hist_count++;
    }
    f.close();
}

// ─────────────────────────────────────────────────────────────────────────────
// OTA — switch boot partition to Marauder (ota_1) and restart
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::bootMarauder() {
    const esp_partition_t* ota1 = esp_partition_find_first(
        ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_OTA_1, nullptr);
    if (ota1) {
        Serial.println(F("[Bible] Switching to Marauder (ota_1)..."));
        esp_ota_set_boot_partition(ota1);
        delay(200);
        esp_restart();
    } else {
        Serial.println(F("[Bible] ota_1 partition not found!"));
        tft.fillRect(0, contentY() + 40, scrW(), 30, TFT_RED);
        tft.setTextColor(TFT_WHITE, TFT_RED);
        tft.drawCentreString("ota_1 not found!", scrW()/2, contentY() + 48, 2);
        delay(2000);
        needs_redraw = true;
    }
}

#endif  // HAS_SCREEN
